[Killed] ArrayDeclaration
src/BellmanFord.js:14:15
  */
 function BellmanFord(graph, V, E, src, dest) {
   // Initialize distance of all vertices as infinite.
-  const dis = Array(V).fill(Infinity);
+  const dis = Array().fill(Infinity);
   // initialize distance of source as 0
   dis[src] = 0;
killedBy: BellmanFord Function Test Case 1
statusReason: expected undefined to deeply equal -2

[Killed] BlockStatement
src/BellmanFord.js:21:35
   // Relax all edges |V| - 1 times. A simple
   // shortest path from src to any other
   // vertex can have at-most |V| - 1 edges
-  for (let i = 0; i < V - 1; i++) {
-    for (let j = 0; j < E; j++) {
-      if (dis[graph[j][0]] + graph[j][2] < dis[graph[j][1]]) {
-        dis[graph[j][1]] = dis[graph[j][0]] + graph[j][2];
-      }
-    }
-  }
+  for (let i = 0; i < V - 1; i++) {}
   // check for negative-weight cycles.
   for (let i = 0; i < E; i++) {
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] ConditionalExpression
src/BellmanFord.js:21:19
   // Relax all edges |V| - 1 times. A simple
   // shortest path from src to any other
   // vertex can have at-most |V| - 1 edges
-  for (let i = 0; i < V - 1; i++) {
+  for (let i = 0; false; i++) {
     for (let j = 0; j < E; j++) {
       if (dis[graph[j][0]] + graph[j][2] < dis[graph[j][1]]) {
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] ConditionalExpression
src/BellmanFord.js:22:21
   // shortest path from src to any other
   // vertex can have at-most |V| - 1 edges
   for (let i = 0; i < V - 1; i++) {
-    for (let j = 0; j < E; j++) {
+    for (let j = 0; false; j++) {
       if (dis[graph[j][0]] + graph[j][2] < dis[graph[j][1]]) {
         dis[graph[j][1]] = dis[graph[j][0]] + graph[j][2];
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] EqualityOperator
src/BellmanFord.js:22:21
   // shortest path from src to any other
   // vertex can have at-most |V| - 1 edges
   for (let i = 0; i < V - 1; i++) {
-    for (let j = 0; j < E; j++) {
+    for (let j = 0; j >= E; j++) {
       if (dis[graph[j][0]] + graph[j][2] < dis[graph[j][1]]) {
         dis[graph[j][1]] = dis[graph[j][0]] + graph[j][2];
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] EqualityOperator
src/BellmanFord.js:23:11
   // vertex can have at-most |V| - 1 edges
   for (let i = 0; i < V - 1; i++) {
     for (let j = 0; j < E; j++) {
-      if (dis[graph[j][0]] + graph[j][2] < dis[graph[j][1]]) {
+      if (dis[graph[j][0]] + graph[j][2] >= dis[graph[j][1]]) {
         dis[graph[j][1]] = dis[graph[j][0]] + graph[j][2];
       }
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] ConditionalExpression
src/BellmanFord.js:23:11
   // vertex can have at-most |V| - 1 edges
   for (let i = 0; i < V - 1; i++) {
     for (let j = 0; j < E; j++) {
-      if (dis[graph[j][0]] + graph[j][2] < dis[graph[j][1]]) {
+      if (true) {
         dis[graph[j][1]] = dis[graph[j][0]] + graph[j][2];
       }
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] ArithmeticOperator
src/BellmanFord.js:24:28
   for (let i = 0; i < V - 1; i++) {
     for (let j = 0; j < E; j++) {
       if (dis[graph[j][0]] + graph[j][2] < dis[graph[j][1]]) {
-        dis[graph[j][1]] = dis[graph[j][0]] + graph[j][2];
+        dis[graph[j][1]] = dis[graph[j][0]] - graph[j][2];
       }
     }
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] UpdateOperator
src/BellmanFord.js:29:26
     }
   }
   // check for negative-weight cycles.
-  for (let i = 0; i < E; i++) {
+  for (let i = 0; i < E; i--) {
     const x = graph[i][0];
     const y = graph[i][1];
killedBy: BellmanFord Function Test Case 1
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/BellmanFord.js:29:19
     }
   }
   // check for negative-weight cycles.
-  for (let i = 0; i < E; i++) {
+  for (let i = 0; i <= E; i++) {
     const x = graph[i][0];
     const y = graph[i][1];
killedBy: BellmanFord Function Test Case 1
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
src/BellmanFord.js:33:32
     const x = graph[i][0];
     const y = graph[i][1];
     const weight = graph[i][2];
-    if (dis[x] !== Infinity && dis[x] + weight < dis[y]) {
+    if (dis[x] !== Infinity && dis[x] - weight < dis[y]) {
       return null;
     }
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] EqualityOperator
src/BellmanFord.js:33:32
     const x = graph[i][0];
     const y = graph[i][1];
     const weight = graph[i][2];
-    if (dis[x] !== Infinity && dis[x] + weight < dis[y]) {
+    if (dis[x] !== Infinity && dis[x] + weight <= dis[y]) {
       return null;
     }
killedBy: BellmanFord Function Test Case 1
statusReason: expected null to deeply equal -2

[Killed] BlockStatement
src/BellmanFord.js:37:31
       return null;
     }
   }
-  for (let i = 0; i < V; i++) {
-    if (i === dest) return dis[i];
-  }
+  for (let i = 0; i < V; i++) {}
 }
 // const graph = [
killedBy: BellmanFord Function Test Case 1
statusReason: expected undefined to deeply equal -2

[Killed] EqualityOperator
src/BellmanFord.js:37:19
       return null;
     }
   }
-  for (let i = 0; i < V; i++) {
+  for (let i = 0; i >= V; i++) {
     if (i === dest) return dis[i];
   }
killedBy: BellmanFord Function Test Case 1
statusReason: expected undefined to deeply equal -2

[Killed] ConditionalExpression
src/BellmanFord.js:38:9
     }
   }
   for (let i = 0; i < V; i++) {
-    if (i === dest) return dis[i];
+    if (false) return dis[i];
   }
 }
killedBy: BellmanFord Function Test Case 1
statusReason: expected undefined to deeply equal -2

[Killed] EqualityOperator
src/BellmanFord.js:38:9
     }
   }
   for (let i = 0; i < V; i++) {
-    if (i === dest) return dis[i];
+    if (i !== dest) return dis[i];
   }
 }
killedBy: BellmanFord Function Test Case 1
statusReason: expected +0 to deeply equal -2
