[Killed] EqualityOperator
src/BreadthFirstShortestPath.js:5:7
 
 export function breadthFirstShortestPath(graph, startNode, targetNode) {
   // check if startNode & targetNode are identical
-  if (startNode === targetNode) {
+  if (startNode !== targetNode) {
     return [startNode];
   }
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [ 'C' ] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] ConditionalExpression
src/BreadthFirstShortestPath.js:5:7
 
 export function breadthFirstShortestPath(graph, startNode, targetNode) {
   // check if startNode & targetNode are identical
-  if (startNode === targetNode) {
+  if (true) {
     return [startNode];
   }
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [ 'C' ] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[NoCoverage] ArrayDeclaration
src/BreadthFirstShortestPath.js:6:12
 export function breadthFirstShortestPath(graph, startNode, targetNode) {
   // check if startNode & targetNode are identical
   if (startNode === targetNode) {
-    return [startNode];
+    return [];
   }
 

[Killed] ArithmeticOperator
src/BreadthFirstShortestPath.js:20:23
   while (!queue.isEmpty()) {
     // start with the queue's first path
     const path = queue.dequeue();
-    const node = path[path.length - 1];
+    const node = path[path.length + 1];
 
     // explore this node if it hasn't been visited yet
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/BreadthFirstShortestPath.js:23:9
     const node = path[path.length - 1];
 
     // explore this node if it hasn't been visited yet
-    if (!visited.has(node)) {
+    if (false) {
       // mark the node as visited
       visited.add(node);
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] BlockStatement
src/BreadthFirstShortestPath.js:23:29
     const node = path[path.length - 1];
 
     // explore this node if it hasn't been visited yet
-    if (!visited.has(node)) {
-      // mark the node as visited
-      visited.add(node);
-
-      const neighbors = graph[node];
-
-      // create a new path in the queue for each neighbor
-      for (let i = 0; i < neighbors.length; i++) {
-        const newPath = path.concat([neighbors[i]]);
-
-        // the first path to contain the target node is the shortest path
-        if (neighbors[i] === targetNode) {
-          return newPath;
-        }
-
-        // queue the new path
-        queue.enqueue(newPath);
-      }
-    }
+    if (!visited.has(node)) {}
   }
 
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] EqualityOperator
src/BreadthFirstShortestPath.js:30:23
       const neighbors = graph[node];
 
       // create a new path in the queue for each neighbor
-      for (let i = 0; i < neighbors.length; i++) {
+      for (let i = 0; i <= neighbors.length; i++) {
         const newPath = path.concat([neighbors[i]]);
 
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/BreadthFirstShortestPath.js:30:23
       const neighbors = graph[node];
 
       // create a new path in the queue for each neighbor
-      for (let i = 0; i < neighbors.length; i++) {
+      for (let i = 0; false; i++) {
         const newPath = path.concat([neighbors[i]]);
 
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] ConditionalExpression
src/BreadthFirstShortestPath.js:34:13
         const newPath = path.concat([neighbors[i]]);
 
         // the first path to contain the target node is the shortest path
-        if (neighbors[i] === targetNode) {
+        if (true) {
           return newPath;
         }
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [ 'C', 'D' ] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] ConditionalExpression
src/BreadthFirstShortestPath.js:34:13
         const newPath = path.concat([neighbors[i]]);
 
         // the first path to contain the target node is the shortest path
-        if (neighbors[i] === targetNode) {
+        if (false) {
           return newPath;
         }
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] ArrayDeclaration
src/BreadthFirstShortestPath.js:45:10
   }
 
   // the target node was not reachable
-  return [];
+  return ["Stryker was here"];
 }
 
killedBy: BreadthFirstShortestPath should return the visited nodes
statusReason: expected [ 'Stryker was here' ] to deeply equal []
