[Killed] BlockStatement
src/DepthFirstSearchIterative.js:3:17
 class GraphUnweightedUndirected {
   // Unweighted Undirected Graph class
-  constructor() {
-    this.connections = {};
-  }
+  constructor() {}
 
   addNode(node) {
killedBy: GraphUnweightedUndirected should add nodes correctly
statusReason: Cannot set properties of undefined (setting 'A')

[Killed] BlockStatement
src/DepthFirstSearchIterative.js:7:17
     this.connections = {};
   }
 
-  addNode(node) {
-    // Function to add a node to the graph (connection represented by set)
-    this.connections[node] = new Set();
-  }
+  addNode(node) {}
 
   addEdge(node1, node2) {
killedBy: GraphUnweightedUndirected should add nodes correctly
statusReason: expected {} to have keys 'A', 'B', and 'C'

[Killed] BlockStatement
src/DepthFirstSearchIterative.js:12:25
     this.connections[node] = new Set();
   }
 
-  addEdge(node1, node2) {
-    // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections)) {
-      this.addNode(node1);
-    }
-    if (!(node2 in this.connections)) {
-      this.addNode(node2);
-    }
-    this.connections[node1].add(node2);
-    this.connections[node2].add(node1);
-  }
+  addEdge(node1, node2) {}
 
   DFSIterative(node, value) {
killedBy: GraphUnweightedUndirected should add edges correctly
statusReason: expected Set{} to have key 'B'

[NoCoverage] BlockStatement
src/DepthFirstSearchIterative.js:14:39
 
   addEdge(node1, node2) {
     // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections)) {
-      this.addNode(node1);
-    }
+    if (!(node1 in this.connections)) {}
     if (!(node2 in this.connections)) {
       this.addNode(node2);

[Survived] ConditionalExpression
src/DepthFirstSearchIterative.js:14:9
 
   addEdge(node1, node2) {
     // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections)) {
+    if (false) {
       this.addNode(node1);
     }

[Survived] ConditionalExpression
src/DepthFirstSearchIterative.js:17:9
     if (!(node1 in this.connections)) {
       this.addNode(node1);
     }
-    if (!(node2 in this.connections)) {
+    if (false) {
       this.addNode(node2);
     }

[Survived] ConditionalExpression
src/DepthFirstSearchIterative.js:17:9
     if (!(node1 in this.connections)) {
       this.addNode(node1);
     }
-    if (!(node2 in this.connections)) {
+    if (true) {
       this.addNode(node2);
     }

[Killed] BlockStatement
src/DepthFirstSearchIterative.js:24:29
     this.connections[node2].add(node1);
   }
 
-  DFSIterative(node, value) {
-    // DFS Function to search if a node with the given value is present in the graph
-    const stack = [node];
-    const visited = new Set();
-    while (stack.length > 0) {
-      const currNode = stack.pop();
-      // if the current node contains the value being searched for, true is returned
-      if (currNode === value) {
-        return true;
-      }
-      // adding the current node to the visited set
-      visited.add(currNode);
-      // adding neighbours in the stack
-      for (const neighbour of this.connections[currNode]) {
-        if (!visited.has(neighbour)) {
-          stack.push(neighbour);
-        }
-      }
-    }
-    return false;
-  }
+  DFSIterative(node, value) {}
 }
 
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected undefined to equal true

[Killed] ArrayDeclaration
src/DepthFirstSearchIterative.js:26:19
 
   DFSIterative(node, value) {
     // DFS Function to search if a node with the given value is present in the graph
-    const stack = [node];
+    const stack = [];
     const visited = new Set();
     while (stack.length > 0) {
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] EqualityOperator
src/DepthFirstSearchIterative.js:28:12
     // DFS Function to search if a node with the given value is present in the graph
     const stack = [node];
     const visited = new Set();
-    while (stack.length > 0) {
+    while (stack.length >= 0) {
       const currNode = stack.pop();
       // if the current node contains the value being searched for, true is returned
killedBy: GraphUnweightedUndirected should perform DFS correctly and not find a node
statusReason: this.connections[currNode] is not iterable

[Killed] ConditionalExpression
src/DepthFirstSearchIterative.js:28:12
     // DFS Function to search if a node with the given value is present in the graph
     const stack = [node];
     const visited = new Set();
-    while (stack.length > 0) {
+    while (false) {
       const currNode = stack.pop();
       // if the current node contains the value being searched for, true is returned
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/DepthFirstSearchIterative.js:31:11
     while (stack.length > 0) {
       const currNode = stack.pop();
       // if the current node contains the value being searched for, true is returned
-      if (currNode === value) {
+      if (true) {
         return true;
       }
killedBy: GraphUnweightedUndirected should perform DFS correctly and not find a node
statusReason: expected true to equal false

[Killed] EqualityOperator
src/DepthFirstSearchIterative.js:31:11
     while (stack.length > 0) {
       const currNode = stack.pop();
       // if the current node contains the value being searched for, true is returned
-      if (currNode === value) {
+      if (currNode !== value) {
         return true;
       }
killedBy: GraphUnweightedUndirected should perform DFS correctly and not find a node
statusReason: expected true to equal false

[Killed] BooleanLiteral
src/DepthFirstSearchIterative.js:32:16
       const currNode = stack.pop();
       // if the current node contains the value being searched for, true is returned
       if (currNode === value) {
-        return true;
+        return false;
       }
       // adding the current node to the visited set
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BlockStatement
src/DepthFirstSearchIterative.js:37:59
       // adding the current node to the visited set
       visited.add(currNode);
       // adding neighbours in the stack
-      for (const neighbour of this.connections[currNode]) {
-        if (!visited.has(neighbour)) {
-          stack.push(neighbour);
-        }
-      }
+      for (const neighbour of this.connections[currNode]) {}
     }
     return false;
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/DepthFirstSearchIterative.js:38:13
       visited.add(currNode);
       // adding neighbours in the stack
       for (const neighbour of this.connections[currNode]) {
-        if (!visited.has(neighbour)) {
+        if (false) {
           stack.push(neighbour);
         }
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BlockStatement
src/DepthFirstSearchIterative.js:38:38
       visited.add(currNode);
       // adding neighbours in the stack
       for (const neighbour of this.connections[currNode]) {
-        if (!visited.has(neighbour)) {
-          stack.push(neighbour);
-        }
+        if (!visited.has(neighbour)) {}
       }
     }
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true
