[Survived] ConditionalExpression
src/DepthFirstSearchRecursive.js:14:9
 
   addEdge(node1, node2) {
     // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections)) {
+    if (true) {
       this.addNode(node1);
     }

[NoCoverage] BlockStatement
src/DepthFirstSearchRecursive.js:17:39
     if (!(node1 in this.connections)) {
       this.addNode(node1);
     }
-    if (!(node2 in this.connections)) {
-      this.addNode(node2);
-    }
+    if (!(node2 in this.connections)) {}
     this.connections[node1].add(node2);
     this.connections[node2].add(node1);

[Killed] BlockStatement
src/DepthFirstSearchRecursive.js:24:50
     this.connections[node2].add(node1);
   }
 
-  DFSRecursive(node, value, visited = new Set()) {
-    // DFS Function to search if a node with the given value is present in the graph
-    // checking if the searching node has been found
-    if (node === value) {
-      return true;
-    }
-    // adding the current node to the visited set
-    visited.add(node);
-    // calling the helper function recursively for all unvisited nodes
-    for (const neighbour of this.connections[node]) {
-      if (!visited.has(neighbour)) {
-        if (this.DFSRecursive(neighbour, value, visited)) {
-          return true;
-        }
-      }
-    }
-    return false;
-  }
+  DFSRecursive(node, value, visited = new Set()) {}
 }
 
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
src/DepthFirstSearchRecursive.js:27:9
   DFSRecursive(node, value, visited = new Set()) {
     // DFS Function to search if a node with the given value is present in the graph
     // checking if the searching node has been found
-    if (node === value) {
+    if (true) {
       return true;
     }
killedBy: GraphUnweightedUndirected should perform DFS correctly and not find a node
statusReason: expected true to equal false

[Killed] BlockStatement
src/DepthFirstSearchRecursive.js:27:25
   DFSRecursive(node, value, visited = new Set()) {
     // DFS Function to search if a node with the given value is present in the graph
     // checking if the searching node has been found
-    if (node === value) {
-      return true;
-    }
+    if (node === value) {}
     // adding the current node to the visited set
     visited.add(node);
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BooleanLiteral
src/DepthFirstSearchRecursive.js:28:14
     // DFS Function to search if a node with the given value is present in the graph
     // checking if the searching node has been found
     if (node === value) {
-      return true;
+      return false;
     }
     // adding the current node to the visited set
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BlockStatement
src/DepthFirstSearchRecursive.js:33:53
     // adding the current node to the visited set
     visited.add(node);
     // calling the helper function recursively for all unvisited nodes
-    for (const neighbour of this.connections[node]) {
-      if (!visited.has(neighbour)) {
-        if (this.DFSRecursive(neighbour, value, visited)) {
-          return true;
-        }
-      }
-    }
+    for (const neighbour of this.connections[node]) {}
     return false;
   }
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BlockStatement
src/DepthFirstSearchRecursive.js:34:36
     visited.add(node);
     // calling the helper function recursively for all unvisited nodes
     for (const neighbour of this.connections[node]) {
-      if (!visited.has(neighbour)) {
-        if (this.DFSRecursive(neighbour, value, visited)) {
-          return true;
-        }
-      }
+      if (!visited.has(neighbour)) {}
     }
     return false;
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BooleanLiteral
src/DepthFirstSearchRecursive.js:34:11
     visited.add(node);
     // calling the helper function recursively for all unvisited nodes
     for (const neighbour of this.connections[node]) {
-      if (!visited.has(neighbour)) {
+      if (visited.has(neighbour)) {
         if (this.DFSRecursive(neighbour, value, visited)) {
           return true;
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/DepthFirstSearchRecursive.js:35:13
     // calling the helper function recursively for all unvisited nodes
     for (const neighbour of this.connections[node]) {
       if (!visited.has(neighbour)) {
-        if (this.DFSRecursive(neighbour, value, visited)) {
+        if (false) {
           return true;
         }
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BlockStatement
src/DepthFirstSearchRecursive.js:35:59
     // calling the helper function recursively for all unvisited nodes
     for (const neighbour of this.connections[node]) {
       if (!visited.has(neighbour)) {
-        if (this.DFSRecursive(neighbour, value, visited)) {
-          return true;
-        }
+        if (this.DFSRecursive(neighbour, value, visited)) {}
       }
     }
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true

[Killed] BooleanLiteral
src/DepthFirstSearchRecursive.js:36:18
     for (const neighbour of this.connections[node]) {
       if (!visited.has(neighbour)) {
         if (this.DFSRecursive(neighbour, value, visited)) {
-          return true;
+          return false;
         }
       }
killedBy: GraphUnweightedUndirected should perform DFS correctly and find a node
statusReason: expected false to equal true
