[Killed] BlockStatement
src/DijkstraSmallestPath.js:13:35
     let neighbor = null;
     let dist = Infinity;
 
-    for (const node in solutions) {
-      if (!solutions[node]) {
-        continue;
-      }
-      const ndist = distances[node];
-      const adj = graph[node];
-
-      for (const a in adj) {
-        if (solutions[a]) {
-          continue;
-        }
-
-        const d = adj[a] + ndist;
-        if (d < dist) {
-          p = solutions[node];
-          neighbor = a;
-          dist = d;
-        }
-      }
-    }
+    for (const node in solutions) {}
 
     // no more solutions
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ] } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Killed] ConditionalExpression
src/DijkstraSmallestPath.js:14:11
     let dist = Infinity;
 
     for (const node in solutions) {
-      if (!solutions[node]) {
+      if (true) {
         continue;
       }
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ] } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Killed] BooleanLiteral
src/DijkstraSmallestPath.js:14:11
     let dist = Infinity;
 
     for (const node in solutions) {
-      if (!solutions[node]) {
+      if (solutions[node]) {
         continue;
       }
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ] } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Killed] BlockStatement
src/DijkstraSmallestPath.js:20:28
       const ndist = distances[node];
       const adj = graph[node];
 
-      for (const a in adj) {
-        if (solutions[a]) {
-          continue;
-        }
-
-        const d = adj[a] + ndist;
-        if (d < dist) {
-          p = solutions[node];
-          neighbor = a;
-          dist = d;
-        }
-      }
+      for (const a in adj) {}
     }
 
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ] } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Killed] ConditionalExpression
src/DijkstraSmallestPath.js:21:13
       const adj = graph[node];
 
       for (const a in adj) {
-        if (solutions[a]) {
+        if (true) {
           continue;
         }
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ] } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Timeout] ConditionalExpression
src/DijkstraSmallestPath.js:21:13
       const adj = graph[node];
 
       for (const a in adj) {
-        if (solutions[a]) {
+        if (false) {
           continue;
         }

[Killed] ArithmeticOperator
src/DijkstraSmallestPath.js:25:19
           continue;
         }
 
-        const d = adj[a] + ndist;
+        const d = adj[a] - ndist;
         if (d < dist) {
           p = solutions[node];
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ], C: [ 'A', 'C' ], …(2) } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Killed] ConditionalExpression
src/DijkstraSmallestPath.js:26:13
         }
 
         const d = adj[a] + ndist;
-        if (d < dist) {
+        if (true) {
           p = solutions[node];
           neighbor = a;
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ], C: [ 'A', 'C' ], …(2) } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Killed] BlockStatement
src/DijkstraSmallestPath.js:26:23
         }
 
         const d = adj[a] + ndist;
-        if (d < dist) {
-          p = solutions[node];
-          neighbor = a;
-          dist = d;
-        }
+        if (d < dist) {}
       }
     }
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected { A: [ 'A' ] } to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }

[Killed] BlockStatement
src/DijkstraSmallestPath.js:35:28
     }
 
     // no more solutions
-    if (dist === Infinity) {
-      break;
-    }
+    if (dist === Infinity) {}
 
     // extend parent's solution path
killedBy: solve should find the shortest path and distances in the graph
statusReason: Cannot read properties of null (reading 'concat')

[Killed] ConditionalExpression
src/DijkstraSmallestPath.js:35:9
     }
 
     // no more solutions
-    if (dist === Infinity) {
+    if (false) {
       break;
     }
killedBy: solve should find the shortest path and distances in the graph
statusReason: Cannot read properties of null (reading 'concat')

[Killed] ObjectLiteral
src/DijkstraSmallestPath.js:45:10
     distances[neighbor] = dist;
   }
 
-  return { solutions, distances };
+  return {};
 }
 
killedBy: solve should find the shortest path and distances in the graph
statusReason: expected undefined to deeply equal { A: [ 'A' ], C: [ 'A', 'C' ], …(2) }
