[Killed] BlockStatement
src/Queue.js:4:17
 class Queue {
   #size;
 
-  constructor() {
-    this.head = null;
-    this.tail = null;
-    this.#size = 0;
-
-    return Object.seal(this);
-  }
+  constructor() {}
 
   get length() {
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
src/Queue.js:12:16
     return Object.seal(this);
   }
 
-  get length() {
-    return this.#size;
-  }
+  get length() {}
 
   /**
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
src/Queue.js:21:17
    * @param {*} data
    * @returns {number} - The current size of queue
    */
-  enqueue(data) {
-    const node = { data, next: null };
-
-    if (!this.head && !this.tail) {
-      this.head = node;
-      this.tail = node;
-    } else {
-      this.tail.next = node;
-      this.tail = node;
-    }
-
-    return ++this.#size;
-  }
+  enqueue(data) {}
 
   /**
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] BooleanLiteral
src/Queue.js:24:9
   enqueue(data) {
     const node = { data, next: null };
 
-    if (!this.head && !this.tail) {
+    if (this.head && !this.tail) {
       this.head = node;
       this.tail = node;
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot set properties of null (setting 'next')

[Killed] BlockStatement
src/Queue.js:24:35
   enqueue(data) {
     const node = { data, next: null };
 
-    if (!this.head && !this.tail) {
-      this.head = node;
-      this.tail = node;
-    } else {
+    if (!this.head && !this.tail) {} else {
       this.tail.next = node;
       this.tail = node;
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
src/Queue.js:27:12
     if (!this.head && !this.tail) {
       this.head = node;
       this.tail = node;
-    } else {
-      this.tail.next = node;
-      this.tail = node;
-    }
+    } else {}
 
     return ++this.#size;
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] UpdateOperator
src/Queue.js:32:12
       this.tail = node;
     }
 
-    return ++this.#size;
+    return --this.#size;
   }
 
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
src/Queue.js:39:13
    * @description - Removes the value at the front of the queue
    * @returns {*} - The first data of the queue
    */
-  dequeue() {
-    if (this.isEmpty()) {
-      throw new Error("Queue is Empty");
-    }
-
-    const firstData = this.peekFirst();
-
-    this.head = this.head.next;
-
-    if (!this.head) {
-      this.tail = null;
-    }
-
-    this.#size--;
-
-    return firstData;
-  }
+  dequeue() {}
 
   /**
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Queue.js:48:21
 
     this.head = this.head.next;
 
-    if (!this.head) {
-      this.tail = null;
-    }
+    if (!this.head) {}
 
     this.#size--;
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
src/Queue.js:48:9
 
     this.head = this.head.next;
 
-    if (!this.head) {
+    if (false) {
       this.tail = null;
     }
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] UpdateOperator
src/Queue.js:52:5
       this.tail = null;
     }
 
-    this.#size--;
+    this.#size++;
 
     return firstData;
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
src/Queue.js:61:15
    * @description - Return the item at the front of the queue
    * @returns {*}
    */
-  peekFirst() {
-    if (this.isEmpty()) {
-      throw new Error("Queue is Empty");
-    }
-
-    return this.head.data;
-  }
+  peekFirst() {}
 
   /**
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/Queue.js:62:9
    * @returns {*}
    */
   peekFirst() {
-    if (this.isEmpty()) {
+    if (false) {
       throw new Error("Queue is Empty");
     }
killedBy: Testing the Queue DS Testing peekFirst & peekLast methods
statusReason: expected 9 to equal 1

[Killed] ConditionalExpression
src/Queue.js:62:9
    * @returns {*}
    */
   peekFirst() {
-    if (this.isEmpty()) {
+    if (true) {
       throw new Error("Queue is Empty");
     }
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Queue is Empty

[Killed] BlockStatement
src/Queue.js:73:14
    * @description - Return the item at the tail of the queue
    * @returns {*}
    */
-  peekLast() {
-    if (this.isEmpty()) {
-      throw new Error("Queue is Empty");
-    }
-
-    return this.tail.data;
-  }
+  peekLast() {}
 
   /**
killedBy: Testing the Queue DS Testing peekFirst & peekLast methods
statusReason: expected undefined to equal 9

[Killed] ConditionalExpression
src/Queue.js:74:9
    * @returns {*}
    */
   peekLast() {
-    if (this.isEmpty()) {
+    if (false) {
       throw new Error("Queue is Empty");
     }
killedBy: Testing the Queue DS Testing peekFirst & peekLast methods
statusReason: Queue is Empty

[Killed] ConditionalExpression
src/Queue.js:74:9
    * @returns {*}
    */
   peekLast() {
-    if (this.isEmpty()) {
+    if (true) {
       throw new Error("Queue is Empty");
     }
killedBy: Testing the Queue DS Testing peekFirst & peekLast methods
statusReason: Queue is Empty

[NoCoverage] StringLiteral
src/Queue.js:75:23
    */
   peekLast() {
     if (this.isEmpty()) {
-      throw new Error("Queue is Empty");
+      throw new Error("");
     }
 

[Killed] BlockStatement
src/Queue.js:85:13
    * @description - Return the array of Queue
    * @returns {Array<*>}
    */
-  toArray() {
-    const array = [];
-    let node = this.head;
-
-    while (node) {
-      array.push(node.data);
-      node = node.next;
-    }
-
-    return array;
-  }
+  toArray() {}
 
   /**
killedBy: Testing the Queue DS Testing toArray method
statusReason: expected undefined to deeply equal [ 1, 2, 8, 9 ]

[Killed] ConditionalExpression
src/Queue.js:89:12
     const array = [];
     let node = this.head;
 
-    while (node) {
+    while (false) {
       array.push(node.data);
       node = node.next;
killedBy: Testing the Queue DS Testing toArray method
statusReason: expected [] to deeply equal [ 1, 2, 8, 9 ]

[Timeout] BlockStatement
src/Queue.js:89:18
     const array = [];
     let node = this.head;
 
-    while (node) {
-      array.push(node.data);
-      node = node.next;
-    }
+    while (node) {}
 
     return array;

[Killed] BlockStatement
src/Queue.js:101:13
    * @description - Return is queue empty or not
    * @returns {boolean}
    */
-  isEmpty() {
-    return this.length === 0;
-  }
+  isEmpty() {}
 }
 
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of null (reading 'data')

[Killed] EqualityOperator
src/Queue.js:102:12
    * @returns {boolean}
    */
   isEmpty() {
-    return this.length === 0;
+    return this.length !== 0;
   }
 }
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] ConditionalExpression
src/Queue.js:102:12
    * @returns {boolean}
    */
   isEmpty() {
-    return this.length === 0;
+    return true;
   }
 }
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]
