[Killed] BooleanLiteral
src/QuickSelectSearch.js:2:7
 export function quickSelectSearch(array, k) {
-  if (!array || array.length <= k) {
+  if (array || array.length <= k) {
     throw new Error("Invalid arguments");
   }
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: Invalid arguments

[Killed] EqualityOperator
src/QuickSelectSearch.js:2:17
 export function quickSelectSearch(array, k) {
-  if (!array || array.length <= k) {
+  if (!array || array.length > k) {
     throw new Error("Invalid arguments");
   }
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: Invalid arguments

[NoCoverage] StringLiteral
src/QuickSelectSearch.js:3:21
 export function quickSelectSearch(array, k) {
   if (!array || array.length <= k) {
-    throw new Error("Invalid arguments");
+    throw new Error("");
   }
 

[Timeout] ArithmeticOperator
src/QuickSelectSearch.js:7:12
   }
 
   let from = 0;
-  let to = array.length - 1;
+  let to = array.length + 1;
   while (from < to) {
     let left = from;

[Killed] ConditionalExpression
src/QuickSelectSearch.js:8:10
 
   let from = 0;
   let to = array.length - 1;
-  while (from < to) {
+  while (false) {
     let left = from;
     let right = to;
killedBy: simplified wiggle sort wiggle sort with duplicates, even array
statusReason: expected [ 1, 2, undefined, 2 ] to deeply equal [ 1, 3, 2, 2 ]

[Killed] EqualityOperator
src/QuickSelectSearch.js:8:10
 
   let from = 0;
   let to = array.length - 1;
-  while (from < to) {
+  while (from >= to) {
     let left = from;
     let right = to;
killedBy: simplified wiggle sort wiggle sort with duplicates, even array
statusReason: expected [ 1, 2, undefined, 2 ] to deeply equal [ 1, 3, 2, 2 ]

[Timeout] ArithmeticOperator
src/QuickSelectSearch.js:11:35
   while (from < to) {
     let left = from;
     let right = to;
-    const pivot = array[Math.ceil((left + right) * 0.5)];
+    const pivot = array[Math.ceil((left + right) / 0.5)];
 
     while (left < right) {

[Timeout] ArithmeticOperator
src/QuickSelectSearch.js:11:36
   while (from < to) {
     let left = from;
     let right = to;
-    const pivot = array[Math.ceil((left + right) * 0.5)];
+    const pivot = array[Math.ceil((left - right) * 0.5)];
 
     while (left < right) {

[Killed] EqualityOperator
src/QuickSelectSearch.js:13:12
     let right = to;
     const pivot = array[Math.ceil((left + right) * 0.5)];
 
-    while (left < right) {
+    while (left <= right) {
       if (array[left] >= pivot) {
         const tmp = array[left];
killedBy: simplified wiggle sort wiggle sort with duplicates, odd array
statusReason: expected [ 1, 2, 1, 4, 1 ] to deeply equal [ 1, 4, 1, 2, 1 ]

[Timeout] EqualityOperator
src/QuickSelectSearch.js:13:12
     let right = to;
     const pivot = array[Math.ceil((left + right) * 0.5)];
 
-    while (left < right) {
+    while (left >= right) {
       if (array[left] >= pivot) {
         const tmp = array[left];

[Killed] ConditionalExpression
src/QuickSelectSearch.js:14:11
     const pivot = array[Math.ceil((left + right) * 0.5)];
 
     while (left < right) {
-      if (array[left] >= pivot) {
+      if (true) {
         const tmp = array[left];
         array[left] = array[right];
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'a', 'b', undefined ] to deeply equal [ 'a', 'c', 'b' ]

[Timeout] ConditionalExpression
src/QuickSelectSearch.js:14:11
     const pivot = array[Math.ceil((left + right) * 0.5)];
 
     while (left < right) {
-      if (array[left] >= pivot) {
+      if (false) {
         const tmp = array[left];
         array[left] = array[right];

[Timeout] UpdateOperator
src/QuickSelectSearch.js:18:9
         const tmp = array[left];
         array[left] = array[right];
         array[right] = tmp;
-        --right;
+        ++right;
       } else {
         ++left;

[Timeout] BlockStatement
src/QuickSelectSearch.js:19:14
         array[left] = array[right];
         array[right] = tmp;
         --right;
-      } else {
-        ++left;
-      }
+      } else {}
     }
 

[Timeout] UpdateOperator
src/QuickSelectSearch.js:20:9
         array[right] = tmp;
         --right;
       } else {
-        ++left;
+        --left;
       }
     }

[Killed] ConditionalExpression
src/QuickSelectSearch.js:24:9
       }
     }
 
-    if (array[left] > pivot) {
+    if (true) {
       --left;
     }
killedBy: simplified wiggle sort wiggle sort with duplicates, even array
statusReason: expected [ 2, 3, 1, 2 ] to deeply equal [ 1, 3, 2, 2 ]

[Killed] EqualityOperator
src/QuickSelectSearch.js:24:9
       }
     }
 
-    if (array[left] > pivot) {
+    if (array[left] <= pivot) {
       --left;
     }
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'a', 'b', 'c' ] to deeply equal [ 'a', 'c', 'b' ]

[Timeout] UpdateOperator
src/QuickSelectSearch.js:25:7
     }
 
     if (array[left] > pivot) {
-      --left;
+      ++left;
     }
 

[Killed] ConditionalExpression
src/QuickSelectSearch.js:28:9
       --left;
     }
 
-    if (k <= left) {
+    if (true) {
       to = left;
     } else {
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'a', 'b', 'c' ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] EqualityOperator
src/QuickSelectSearch.js:28:9
       --left;
     }
 
-    if (k <= left) {
+    if (k < left) {
       to = left;
     } else {
killedBy: simplified wiggle sort wiggle sort with duplicates, even array
statusReason: expected [ 2, 3, 1, 2 ] to deeply equal [ 1, 3, 2, 2 ]

[Timeout] BlockStatement
src/QuickSelectSearch.js:30:12
 
     if (k <= left) {
       to = left;
-    } else {
-      from = left + 1;
-    }
+    } else {}
   }
   return array;

[Timeout] ArithmeticOperator
src/QuickSelectSearch.js:31:14
     if (k <= left) {
       to = left;
     } else {
-      from = left + 1;
+      from = left - 1;
     }
   }
