[Survived] LogicalOperator
src/RadixSort.js:3:7
 export function radixSort(items, RADIX) {
   // default radix is then because we usually count to base 10
-  if (RADIX === undefined || RADIX < 1) {
+  if (RADIX === undefined && RADIX < 1) {
     RADIX = 10;
   }

[Survived] ConditionalExpression
src/RadixSort.js:3:7
 export function radixSort(items, RADIX) {
   // default radix is then because we usually count to base 10
-  if (RADIX === undefined || RADIX < 1) {
+  if (false) {
     RADIX = 10;
   }

[Killed] BooleanLiteral
src/RadixSort.js:7:19
     RADIX = 10;
   }
 
-  let maxLength = false;
+  let maxLength = true;
   let placement = 1;
 
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] BooleanLiteral
src/RadixSort.js:10:10
   let maxLength = false;
   let placement = 1;
 
-  while (!maxLength) {
+  while (maxLength) {
     maxLength = true;
     const buckets = [];
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] ConditionalExpression
src/RadixSort.js:10:10
   let maxLength = false;
   let placement = 1;
 
-  while (!maxLength) {
+  while (false) {
     maxLength = true;
     const buckets = [];
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Timeout] BooleanLiteral
src/RadixSort.js:11:17
   let placement = 1;
 
   while (!maxLength) {
-    maxLength = true;
+    maxLength = false;
     const buckets = [];
 

[Killed] EqualityOperator
src/RadixSort.js:14:21
     maxLength = true;
     const buckets = [];
 
-    for (let i = 0; i < RADIX; i++) {
+    for (let i = 0; i >= RADIX; i++) {
       buckets.push([]);
     }
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/RadixSort.js:14:21
     maxLength = true;
     const buckets = [];
 
-    for (let i = 0; i < RADIX; i++) {
+    for (let i = 0; false; i++) {
       buckets.push([]);
     }
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/RadixSort.js:18:44
       buckets.push([]);
     }
 
-    for (let j = 0; j < items.length; j++) {
-      const tmp = items[j] / placement;
-      buckets[Math.floor(tmp % RADIX)].push(items[j]);
-      if (maxLength && tmp > 0) {
-        maxLength = false;
-      }
-    }
+    for (let j = 0; j < items.length; j++) {}
 
     let a = 0;
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] EqualityOperator
src/RadixSort.js:18:21
       buckets.push([]);
     }
 
-    for (let j = 0; j < items.length; j++) {
+    for (let j = 0; j <= items.length; j++) {
       const tmp = items[j] / placement;
       buckets[Math.floor(tmp % RADIX)].push(items[j]);
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArithmeticOperator
src/RadixSort.js:19:19
     }
 
     for (let j = 0; j < items.length; j++) {
-      const tmp = items[j] / placement;
+      const tmp = items[j] * placement;
       buckets[Math.floor(tmp % RADIX)].push(items[j]);
       if (maxLength && tmp > 0) {
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArithmeticOperator
src/RadixSort.js:20:26
 
     for (let j = 0; j < items.length; j++) {
       const tmp = items[j] / placement;
-      buckets[Math.floor(tmp % RADIX)].push(items[j]);
+      buckets[Math.floor(tmp * RADIX)].push(items[j]);
       if (maxLength && tmp > 0) {
         maxLength = false;
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'push')

[Survived] BlockStatement
src/RadixSort.js:21:33
     for (let j = 0; j < items.length; j++) {
       const tmp = items[j] / placement;
       buckets[Math.floor(tmp % RADIX)].push(items[j]);
-      if (maxLength && tmp > 0) {
-        maxLength = false;
-      }
+      if (maxLength && tmp > 0) {}
     }
 

[Survived] EqualityOperator
src/RadixSort.js:21:24
     for (let j = 0; j < items.length; j++) {
       const tmp = items[j] / placement;
       buckets[Math.floor(tmp % RADIX)].push(items[j]);
-      if (maxLength && tmp > 0) {
+      if (maxLength && tmp <= 0) {
         maxLength = false;
       }

[Survived] BooleanLiteral
src/RadixSort.js:22:21
       const tmp = items[j] / placement;
       buckets[Math.floor(tmp % RADIX)].push(items[j]);
       if (maxLength && tmp > 0) {
-        maxLength = false;
+        maxLength = true;
       }
     }

[Killed] ConditionalExpression
src/RadixSort.js:27:21
     }
 
     let a = 0;
-    for (let b = 0; b < RADIX; b++) {
+    for (let b = 0; false; b++) {
       const buck = buckets[b];
       for (let k = 0; k < buck.length; k++) {
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] UpdateOperator
src/RadixSort.js:27:32
     }
 
     let a = 0;
-    for (let b = 0; b < RADIX; b++) {
+    for (let b = 0; b < RADIX; b--) {
       const buck = buckets[b];
       for (let k = 0; k < buck.length; k++) {
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/RadixSort.js:29:23
     let a = 0;
     for (let b = 0; b < RADIX; b++) {
       const buck = buckets[b];
-      for (let k = 0; k < buck.length; k++) {
+      for (let k = 0; k <= buck.length; k++) {
         items[a] = buck[k];
         a++;
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/RadixSort.js:29:23
     let a = 0;
     for (let b = 0; b < RADIX; b++) {
       const buck = buckets[b];
-      for (let k = 0; k < buck.length; k++) {
+      for (let k = 0; false; k++) {
         items[a] = buck[k];
         a++;
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] UpdateOperator
src/RadixSort.js:31:9
       const buck = buckets[b];
       for (let k = 0; k < buck.length; k++) {
         items[a] = buck[k];
-        a++;
+        a--;
       }
     }
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: expected [ 1, 3, 2, 1, '-1': 3, …(2) ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] AssignmentOperator
src/RadixSort.js:34:5
         a++;
       }
     }
-    placement *= RADIX;
+    placement /= RADIX;
   }
   return items;
killedBy: Radix Sort should sort the array [4, 3, 2, 1] to [1, 2, 3, 4]
statusReason: Cannot read properties of undefined (reading 'push')
