[Killed] BlockStatement
src/BreadthFirstSearch.js:15:29
     // start with the queue's first node
     const node = queue.dequeue();
 
-    if (!visited.has(node)) {
-      // mark the node as visited
-      visited.add(node);
-      const neighbors = graph[node];
-
-      // put all its neighbors into the queue
-      for (let i = 0; i < neighbors.length; i++) {
-        queue.enqueue(neighbors[i]);
-      }
-    }
+    if (!visited.has(node)) {}
   }
 
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] ConditionalExpression
src/BreadthFirstSearch.js:15:9
     // start with the queue's first node
     const node = queue.dequeue();
 
-    if (!visited.has(node)) {
+    if (false) {
       // mark the node as visited
       visited.add(node);
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: expected [] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]

[Killed] EqualityOperator
src/BreadthFirstSearch.js:21:23
       const neighbors = graph[node];
 
       // put all its neighbors into the queue
-      for (let i = 0; i < neighbors.length; i++) {
+      for (let i = 0; i <= neighbors.length; i++) {
         queue.enqueue(neighbors[i]);
       }
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/BreadthFirstSearch.js:21:23
       const neighbors = graph[node];
 
       // put all its neighbors into the queue
-      for (let i = 0; i < neighbors.length; i++) {
+      for (let i = 0; false; i++) {
         queue.enqueue(neighbors[i]);
       }
killedBy: BreadthFirstSearch should return the visited nodes
statusReason: expected [ 'C' ] to deeply equal [ 'C', 'D', 'A', 'B', 'E' ]
