[Killed] BlockStatement
src/BubbleSort.js:1:35
-export function bubbleSort(items) {
-  const length = items.length;
-  let noSwaps;
-
-  for (let i = length; i > 0; i--) {
-    // flag for optimization
-    noSwaps = true;
-    // Number of passes
-    for (let j = 0; j < i - 1; j++) {
-      // Compare the adjacent positions
-      if (items[j] > items[j + 1]) {
-        // Swap the numbers
-        [items[j], items[j + 1]] = [items[j + 1], items[j]];
-        noSwaps = false;
-      }
-    }
-    if (noSwaps) {
-      break;
-    }
-  }
-
-  return items;
-}
+export function bubbleSort(items) {}
 
 /**
killedBy: bubbleSort should sort arrays correctly
statusReason: expected undefined to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] EqualityOperator
src/BubbleSort.js:5:24
   const length = items.length;
   let noSwaps;
 
-  for (let i = length; i > 0; i--) {
+  for (let i = length; i <= 0; i--) {
     // flag for optimization
     noSwaps = true;
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ConditionalExpression
src/BubbleSort.js:5:24
   const length = items.length;
   let noSwaps;
 
-  for (let i = length; i > 0; i--) {
+  for (let i = length; false; i--) {
     // flag for optimization
     noSwaps = true;
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Survived] BooleanLiteral
src/BubbleSort.js:7:15
 
   for (let i = length; i > 0; i--) {
     // flag for optimization
-    noSwaps = true;
+    noSwaps = false;
     // Number of passes
     for (let j = 0; j < i - 1; j++) {

[Killed] ConditionalExpression
src/BubbleSort.js:9:21
     // flag for optimization
     noSwaps = true;
     // Number of passes
-    for (let j = 0; j < i - 1; j++) {
+    for (let j = 0; false; j++) {
       // Compare the adjacent positions
       if (items[j] > items[j + 1]) {
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] BlockStatement
src/BubbleSort.js:9:37
     // flag for optimization
     noSwaps = true;
     // Number of passes
-    for (let j = 0; j < i - 1; j++) {
-      // Compare the adjacent positions
-      if (items[j] > items[j + 1]) {
-        // Swap the numbers
-        [items[j], items[j + 1]] = [items[j + 1], items[j]];
-        noSwaps = false;
-      }
-    }
+    for (let j = 0; j < i - 1; j++) {}
     if (noSwaps) {
       break;
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/BubbleSort.js:11:28
     // Number of passes
     for (let j = 0; j < i - 1; j++) {
       // Compare the adjacent positions
-      if (items[j] > items[j + 1]) {
+      if (items[j] > items[j - 1]) {
         // Swap the numbers
         [items[j], items[j + 1]] = [items[j + 1], items[j]];
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 3, 2 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] BlockStatement
src/BubbleSort.js:11:36
     // Number of passes
     for (let j = 0; j < i - 1; j++) {
       // Compare the adjacent positions
-      if (items[j] > items[j + 1]) {
-        // Swap the numbers
-        [items[j], items[j + 1]] = [items[j + 1], items[j]];
-        noSwaps = false;
-      }
+      if (items[j] > items[j + 1]) {}
     }
     if (noSwaps) {
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/BubbleSort.js:13:43
       // Compare the adjacent positions
       if (items[j] > items[j + 1]) {
         // Swap the numbers
-        [items[j], items[j + 1]] = [items[j + 1], items[j]];
+        [items[j], items[j + 1]] = [items[j - 1], items[j]];
         noSwaps = false;
       }
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ undefined, undefined, …(3) ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/BubbleSort.js:13:26
       // Compare the adjacent positions
       if (items[j] > items[j + 1]) {
         // Swap the numbers
-        [items[j], items[j + 1]] = [items[j + 1], items[j]];
+        [items[j], items[j - 1]] = [items[j + 1], items[j]];
         noSwaps = false;
       }
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 1, 1, 1, 2, 3, '-1': 4 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] BooleanLiteral
src/BubbleSort.js:14:19
       if (items[j] > items[j + 1]) {
         // Swap the numbers
         [items[j], items[j + 1]] = [items[j + 1], items[j]];
-        noSwaps = false;
+        noSwaps = true;
       }
     }
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 4, 1, 2, 3, 5 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ConditionalExpression
src/BubbleSort.js:17:9
         noSwaps = false;
       }
     }
-    if (noSwaps) {
+    if (true) {
       break;
     }
killedBy: bubbleSort should sort arrays correctly
statusReason: expected [ 4, 1, 2, 3, 5 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Survived] ConditionalExpression
src/BubbleSort.js:17:9
         noSwaps = false;
       }
     }
-    if (noSwaps) {
+    if (false) {
       break;
     }

[Killed] BlockStatement
src/BubbleSort.js:28:44
 /**
  * Using a while loop and a for loop.
  */
-export function alternativeBubbleSort(arr) {
-  let swapped = true;
-
-  while (swapped) {
-    swapped = false;
-    for (let i = 0; i < arr.length - 1; i++) {
-      if (arr[i] > arr[i + 1]) {
-        [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
-        swapped = true;
-      }
-    }
-  }
-
-  return arr;
-}
+export function alternativeBubbleSort(arr) {}
 
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected undefined to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] BooleanLiteral
src/BubbleSort.js:29:17
  * Using a while loop and a for loop.
  */
 export function alternativeBubbleSort(arr) {
-  let swapped = true;
+  let swapped = false;
 
   while (swapped) {
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ConditionalExpression
src/BubbleSort.js:31:10
 export function alternativeBubbleSort(arr) {
   let swapped = true;
 
-  while (swapped) {
+  while (false) {
     swapped = false;
     for (let i = 0; i < arr.length - 1; i++) {
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Timeout] BlockStatement
src/BubbleSort.js:31:19
 export function alternativeBubbleSort(arr) {
   let swapped = true;
 
-  while (swapped) {
-    swapped = false;
-    for (let i = 0; i < arr.length - 1; i++) {
-      if (arr[i] > arr[i + 1]) {
-        [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
-        swapped = true;
-      }
-    }
-  }
+  while (swapped) {}
 
   return arr;

[Timeout] BooleanLiteral
src/BubbleSort.js:32:15
   let swapped = true;
 
   while (swapped) {
-    swapped = false;
+    swapped = true;
     for (let i = 0; i < arr.length - 1; i++) {
       if (arr[i] > arr[i + 1]) {

[Killed] ConditionalExpression
src/BubbleSort.js:33:21
 
   while (swapped) {
     swapped = false;
-    for (let i = 0; i < arr.length - 1; i++) {
+    for (let i = 0; false; i++) {
       if (arr[i] > arr[i + 1]) {
         [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] EqualityOperator
src/BubbleSort.js:33:21
 
   while (swapped) {
     swapped = false;
-    for (let i = 0; i < arr.length - 1; i++) {
+    for (let i = 0; i >= arr.length - 1; i++) {
       if (arr[i] > arr[i + 1]) {
         [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ConditionalExpression
src/BubbleSort.js:34:11
   while (swapped) {
     swapped = false;
     for (let i = 0; i < arr.length - 1; i++) {
-      if (arr[i] > arr[i + 1]) {
+      if (false) {
         [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
         swapped = true;
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] BlockStatement
src/BubbleSort.js:34:32
   while (swapped) {
     swapped = false;
     for (let i = 0; i < arr.length - 1; i++) {
-      if (arr[i] > arr[i + 1]) {
-        [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
-        swapped = true;
-      }
+      if (arr[i] > arr[i + 1]) {}
     }
   }
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/BubbleSort.js:35:37
     swapped = false;
     for (let i = 0; i < arr.length - 1; i++) {
       if (arr[i] > arr[i + 1]) {
-        [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
+        [arr[i], arr[i + 1]] = [arr[i - 1], arr[i]];
         swapped = true;
       }
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ undefined, undefined, …(3) ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/BubbleSort.js:35:22
     swapped = false;
     for (let i = 0; i < arr.length - 1; i++) {
       if (arr[i] > arr[i + 1]) {
-        [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
+        [arr[i], arr[i - 1]] = [arr[i + 1], arr[i]];
         swapped = true;
       }
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 1, 1, 1, 2, 3, '-1': 4 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] BooleanLiteral
src/BubbleSort.js:36:19
     for (let i = 0; i < arr.length - 1; i++) {
       if (arr[i] > arr[i + 1]) {
         [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]];
-        swapped = true;
+        swapped = false;
       }
     }
killedBy: alternativeBubbleSort should sort arrays correctly
statusReason: expected [ 4, 1, 2, 3, 5 ] to deeply equal [ 1, 2, 3, 4, 5 ]
