[Killed] BlockStatement
src/ConnectedComponents.js:24:43
     this.connections[node2].add(node1);
   }
 
-  DFSComponent(components, node, visited) {
-    // Helper function to populate the visited set with the nodes in each component
-
-    // adding the first visited node in the component to the array
-    components.push(node);
-    const stack = [node];
-    // populating the visited set using DFS (Iterative)
-    while (stack.length > 0) {
-      const curr = stack.pop();
-      visited.add(curr.toString());
-      for (const neighbour of this.connections[curr].keys()) {
-        if (!visited.has(neighbour.toString())) {
-          stack.push(neighbour);
-        }
-      }
-    }
-  }
+  DFSComponent(components, node, visited) {}
 
   connectedComponents() {
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrayDeclaration
src/ConnectedComponents.js:29:19
 
     // adding the first visited node in the component to the array
     components.push(node);
-    const stack = [node];
+    const stack = [];
     // populating the visited set using DFS (Iterative)
     while (stack.length > 0) {
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [ 'A', 'B', 'C' ] to have a length of 2 but got 3

[Killed] EqualityOperator
src/ConnectedComponents.js:31:12
     components.push(node);
     const stack = [node];
     // populating the visited set using DFS (Iterative)
-    while (stack.length > 0) {
+    while (stack.length <= 0) {
       const curr = stack.pop();
       visited.add(curr.toString());
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [ 'A', 'B', 'C' ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/ConnectedComponents.js:31:12
     components.push(node);
     const stack = [node];
     // populating the visited set using DFS (Iterative)
-    while (stack.length > 0) {
+    while (false) {
       const curr = stack.pop();
       visited.add(curr.toString());
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [ 'A', 'B', 'C' ] to have a length of 2 but got 3

[Killed] BlockStatement
src/ConnectedComponents.js:34:62
     while (stack.length > 0) {
       const curr = stack.pop();
       visited.add(curr.toString());
-      for (const neighbour of this.connections[curr].keys()) {
-        if (!visited.has(neighbour.toString())) {
-          stack.push(neighbour);
-        }
-      }
+      for (const neighbour of this.connections[curr].keys()) {}
     }
   }
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [ 'A', 'B', 'C' ] to have a length of 2 but got 3

[Killed] BlockStatement
src/ConnectedComponents.js:35:49
       const curr = stack.pop();
       visited.add(curr.toString());
       for (const neighbour of this.connections[curr].keys()) {
-        if (!visited.has(neighbour.toString())) {
-          stack.push(neighbour);
-        }
+        if (!visited.has(neighbour.toString())) {}
       }
     }
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [ 'A', 'B', 'C' ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/ConnectedComponents.js:35:13
       const curr = stack.pop();
       visited.add(curr.toString());
       for (const neighbour of this.connections[curr].keys()) {
-        if (!visited.has(neighbour.toString())) {
+        if (false) {
           stack.push(neighbour);
         }
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [ 'A', 'B', 'C' ] to have a length of 2 but got 3

[Killed] BlockStatement
src/ConnectedComponents.js:42:25
     }
   }
 
-  connectedComponents() {
-    // Function to generate the Connected Components
-    // Result is an array containing 1 node from each component
-    const visited = new Set();
-    const components = [];
-    for (const node of Object.keys(this.connections)) {
-      if (!visited.has(node.toString())) {
-        this.DFSComponent(components, node, visited);
-      }
-    }
-    return components;
-  }
+  connectedComponents() {}
 }
 
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/ConnectedComponents.js:47:55
     // Result is an array containing 1 node from each component
     const visited = new Set();
     const components = [];
-    for (const node of Object.keys(this.connections)) {
-      if (!visited.has(node.toString())) {
-        this.DFSComponent(components, node, visited);
-      }
-    }
+    for (const node of Object.keys(this.connections)) {}
     return components;
   }
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/ConnectedComponents.js:48:42
     const visited = new Set();
     const components = [];
     for (const node of Object.keys(this.connections)) {
-      if (!visited.has(node.toString())) {
-        this.DFSComponent(components, node, visited);
-      }
+      if (!visited.has(node.toString())) {}
     }
     return components;
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [] to have a length of 2 but got +0

[Killed] BooleanLiteral
src/ConnectedComponents.js:48:11
     const visited = new Set();
     const components = [];
     for (const node of Object.keys(this.connections)) {
-      if (!visited.has(node.toString())) {
+      if (visited.has(node.toString())) {
         this.DFSComponent(components, node, visited);
       }
killedBy: GraphUnweightedUndirectedAdjacencyList should correctly identify connected components
statusReason: expected [] to have a length of 2 but got +0
