[Killed] BlockStatement
src/CountingSort.js:1:48
-export const countingSort = (arr, min, max) => {
-  // Create an auxiliary resultant array
-  const res = [];
-  // Create and initialize the frequency[count] array
-  const count = new Array(max - min + 1).fill(0);
-  // Populate the freq array
-  for (let i = 0; i < arr.length; i++) {
-    count[arr[i] - min]++;
-  }
-  // Create a prefix sum array out of the frequency[count] array
-  count[0] -= 1;
-  for (let i = 1; i < count.length; i++) {
-    count[i] += count[i - 1];
-  }
-  // Populate the result array using the prefix sum array
-  for (let i = arr.length - 1; i >= 0; i--) {
-    res[count[arr[i] - min]] = arr[i];
-    count[arr[i] - min]--;
-  }
-  return res;
-};
+export const countingSort = (arr, min, max) => {};
 
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected undefined to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/CountingSort.js:5:27
   // Create an auxiliary resultant array
   const res = [];
   // Create and initialize the frequency[count] array
-  const count = new Array(max - min + 1).fill(0);
+  const count = new Array(max - min - 1).fill(0);
   // Populate the freq array
   for (let i = 0; i < arr.length; i++) {
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ +0, 1, 2, 3, NaN: 5 ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Survived] ArithmeticOperator
src/CountingSort.js:5:27
   // Create an auxiliary resultant array
   const res = [];
   // Create and initialize the frequency[count] array
-  const count = new Array(max - min + 1).fill(0);
+  const count = new Array(max + min + 1).fill(0);
   // Populate the freq array
   for (let i = 0; i < arr.length; i++) {

[Killed] BlockStatement
src/CountingSort.js:7:40
   // Create and initialize the frequency[count] array
   const count = new Array(max - min + 1).fill(0);
   // Populate the freq array
-  for (let i = 0; i < arr.length; i++) {
-    count[arr[i] - min]++;
-  }
+  for (let i = 0; i < arr.length; i++) {}
   // Create a prefix sum array out of the frequency[count] array
   count[0] -= 1;
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ , '-1': 3 ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] EqualityOperator
src/CountingSort.js:7:19
   // Create and initialize the frequency[count] array
   const count = new Array(max - min + 1).fill(0);
   // Populate the freq array
-  for (let i = 0; i < arr.length; i++) {
+  for (let i = 0; i >= arr.length; i++) {
     count[arr[i] - min]++;
   }
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ , '-1': 3 ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/CountingSort.js:8:11
   const count = new Array(max - min + 1).fill(0);
   // Populate the freq array
   for (let i = 0; i < arr.length; i++) {
-    count[arr[i] - min]++;
+    count[arr[i] + min]++;
   }
   // Create a prefix sum array out of the frequency[count] array
killedBy: countingSort Function should sort the array [6, 4, 2, 1, 3, 5] to [1, 2, 3, 4, 5, 6]
statusReason: expected [ 3, 4, 5, 6, '-1': 2 ] to deeply equal [ 1, 2, 3, 4, 5, 6 ]

[Killed] UpdateOperator
src/CountingSort.js:8:5
   const count = new Array(max - min + 1).fill(0);
   // Populate the freq array
   for (let i = 0; i < arr.length; i++) {
-    count[arr[i] - min]++;
+    count[arr[i] - min]--;
   }
   // Create a prefix sum array out of the frequency[count] array
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ , '-3': 1, '-6': 4, '-7': 5, …(3) ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] AssignmentOperator
src/CountingSort.js:11:3
     count[arr[i] - min]++;
   }
   // Create a prefix sum array out of the frequency[count] array
-  count[0] -= 1;
+  count[0] += 1;
   for (let i = 1; i < count.length; i++) {
     count[i] += count[i - 1];
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ Array(8) ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] BlockStatement
src/CountingSort.js:12:42
   }
   // Create a prefix sum array out of the frequency[count] array
   count[0] -= 1;
-  for (let i = 1; i < count.length; i++) {
-    count[i] += count[i - 1];
-  }
+  for (let i = 1; i < count.length; i++) {}
   // Populate the result array using the prefix sum array
   for (let i = arr.length - 1; i >= 0; i--) {
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ +0, 3 ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] EqualityOperator
src/CountingSort.js:12:19
   }
   // Create a prefix sum array out of the frequency[count] array
   count[0] -= 1;
-  for (let i = 1; i < count.length; i++) {
+  for (let i = 1; i >= count.length; i++) {
     count[i] += count[i - 1];
   }
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ +0, 3 ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] AssignmentOperator
src/CountingSort.js:13:5
   // Create a prefix sum array out of the frequency[count] array
   count[0] -= 1;
   for (let i = 1; i < count.length; i++) {
-    count[i] += count[i - 1];
+    count[i] -= count[i - 1];
   }
   // Populate the result array using the prefix sum array
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ +0, 3 ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/CountingSort.js:13:23
   // Create a prefix sum array out of the frequency[count] array
   count[0] -= 1;
   for (let i = 1; i < count.length; i++) {
-    count[i] += count[i - 1];
+    count[i] += count[i + 1];
   }
   // Populate the result array using the prefix sum array
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [ +0, undefined, 3 ] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] BlockStatement
src/CountingSort.js:16:45
     count[i] += count[i - 1];
   }
   // Populate the result array using the prefix sum array
-  for (let i = arr.length - 1; i >= 0; i--) {
-    res[count[arr[i] - min]] = arr[i];
-    count[arr[i] - min]--;
-  }
+  for (let i = arr.length - 1; i >= 0; i--) {}
   return res;
 };
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] ConditionalExpression
src/CountingSort.js:16:32
     count[i] += count[i - 1];
   }
   // Populate the result array using the prefix sum array
-  for (let i = arr.length - 1; i >= 0; i--) {
+  for (let i = arr.length - 1; false; i--) {
     res[count[arr[i] - min]] = arr[i];
     count[arr[i] - min]--;
killedBy: countingSort Function should sort the array [3, 0, 2, 5, 4, 1] to [0, 1, 2, 3, 4, 5]
statusReason: expected [] to deeply equal [ +0, 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/CountingSort.js:17:15
   }
   // Populate the result array using the prefix sum array
   for (let i = arr.length - 1; i >= 0; i--) {
-    res[count[arr[i] - min]] = arr[i];
+    res[count[arr[i] + min]] = arr[i];
     count[arr[i] - min]--;
   }
killedBy: countingSort Function should sort the array [6, 4, 2, 1, 3, 5] to [1, 2, 3, 4, 5, 6]
statusReason: expected [ undefined, 1, undefined, 2, …(2) ] to deeply equal [ 1, 2, 3, 4, 5, 6 ]

[Killed] ArithmeticOperator
src/CountingSort.js:18:11
   // Populate the result array using the prefix sum array
   for (let i = arr.length - 1; i >= 0; i--) {
     res[count[arr[i] - min]] = arr[i];
-    count[arr[i] - min]--;
+    count[arr[i] + min]--;
   }
   return res;
killedBy: countingSort Function should sort the array [6, 4, 2, 1, 3, 5] to [1, 2, 3, 4, 5, 6]
statusReason: expected [ 1, 2, 4, undefined, 6 ] to deeply equal [ 1, 2, 3, 4, 5, 6 ]

[Survived] UpdateOperator
src/CountingSort.js:18:5
   // Populate the result array using the prefix sum array
   for (let i = arr.length - 1; i >= 0; i--) {
     res[count[arr[i] - min]] = arr[i];
-    count[arr[i] - min]--;
+    count[arr[i] - min]++;
   }
   return res;
