[Killed] BlockStatement
src/Dijkstra.js:1:28
-function createGraph(V, E) {
-  // V - Number of vertices in graph
-  // E - Number of edges in graph (u,v,w)
-  const adjList = []; // Adjacency list
-  for (let i = 0; i < V; i++) {
-    adjList.push([]);
-  }
-  for (let i = 0; i < E.length; i++) {
-    adjList[E[i][0]].push([E[i][1], E[i][2]]);
-    adjList[E[i][1]].push([E[i][0], E[i][2]]);
-  }
-  return adjList;
-}
+function createGraph(V, E) {}
 
 function djikstra(graph, V, src) {
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/Dijkstra.js:5:19
   // V - Number of vertices in graph
   // E - Number of edges in graph (u,v,w)
   const adjList = []; // Adjacency list
-  for (let i = 0; i < V; i++) {
+  for (let i = 0; false; i++) {
     adjList.push([]);
   }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] EqualityOperator
src/Dijkstra.js:5:19
   // V - Number of vertices in graph
   // E - Number of edges in graph (u,v,w)
   const adjList = []; // Adjacency list
-  for (let i = 0; i < V; i++) {
+  for (let i = 0; i >= V; i++) {
     adjList.push([]);
   }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading 'push')

[Survived] ArrayDeclaration
src/Dijkstra.js:6:18
   // E - Number of edges in graph (u,v,w)
   const adjList = []; // Adjacency list
   for (let i = 0; i < V; i++) {
-    adjList.push([]);
+    adjList.push(["Stryker was here"]);
   }
   for (let i = 0; i < E.length; i++) {

[Killed] BlockStatement
src/Dijkstra.js:8:38
   for (let i = 0; i < V; i++) {
     adjList.push([]);
   }
-  for (let i = 0; i < E.length; i++) {
-    adjList[E[i][0]].push([E[i][1], E[i][2]]);
-    adjList[E[i][1]].push([E[i][0], E[i][2]]);
-  }
+  for (let i = 0; i < E.length; i++) {}
   return adjList;
 }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 10000, -1 ] to deeply equal [ 4, +0 ]

[Killed] EqualityOperator
src/Dijkstra.js:8:19
   for (let i = 0; i < V; i++) {
     adjList.push([]);
   }
-  for (let i = 0; i < E.length; i++) {
+  for (let i = 0; i >= E.length; i++) {
     adjList[E[i][0]].push([E[i][1], E[i][2]]);
     adjList[E[i][1]].push([E[i][0], E[i][2]]);
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 10000, -1 ] to deeply equal [ 4, +0 ]

[Killed] ArrayDeclaration
src/Dijkstra.js:9:27
     adjList.push([]);
   }
   for (let i = 0; i < E.length; i++) {
-    adjList[E[i][0]].push([E[i][1], E[i][2]]);
+    adjList[E[i][0]].push([]);
     adjList[E[i][1]].push([E[i][0], E[i][2]]);
   }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 10000, -1 ] to deeply equal [ 4, +0 ]

[Killed] ArrayDeclaration
src/Dijkstra.js:17:16
 
 function djikstra(graph, V, src) {
   const vis = Array(V).fill(0);
-  const dist = [];
+  const dist = ["Stryker was here"];
   for (let i = 0; i < V; i++) dist.push([10000, -1]);
   dist[src][0] = 0;
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot assign to read only property '0' of string 'Stryker was here'

[Killed] EqualityOperator
src/Dijkstra.js:18:19
 function djikstra(graph, V, src) {
   const vis = Array(V).fill(0);
   const dist = [];
-  for (let i = 0; i < V; i++) dist.push([10000, -1]);
+  for (let i = 0; i >= V; i++) dist.push([10000, -1]);
   dist[src][0] = 0;
 
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot set properties of undefined (setting '0')

[Killed] ConditionalExpression
src/Dijkstra.js:18:19
 function djikstra(graph, V, src) {
   const vis = Array(V).fill(0);
   const dist = [];
-  for (let i = 0; i < V; i++) dist.push([10000, -1]);
+  for (let i = 0; false; i++) dist.push([10000, -1]);
   dist[src][0] = 0;
 
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot set properties of undefined (setting '0')

[Killed] UpdateOperator
src/Dijkstra.js:21:30
   for (let i = 0; i < V; i++) dist.push([10000, -1]);
   dist[src][0] = 0;
 
-  for (let i = 0; i < V - 1; i++) {
+  for (let i = 0; i < V - 1; i--) {
     let mn = -1;
     for (let j = 0; j < V; j++) {
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Dijkstra.js:21:35
   for (let i = 0; i < V; i++) dist.push([10000, -1]);
   dist[src][0] = 0;
 
-  for (let i = 0; i < V - 1; i++) {
-    let mn = -1;
-    for (let j = 0; j < V; j++) {
-      if (vis[j] === 0) {
-        if (mn === -1 || dist[j][0] < dist[mn][0]) mn = j;
-      }
-    }
-
-    vis[mn] = 1;
-    for (let j = 0; j < graph[mn].length; j++) {
-      const edge = graph[mn][j];
-      if (vis[edge[0]] === 0 && dist[edge[0]][0] > dist[mn][0] + edge[1]) {
-        dist[edge[0]][0] = dist[mn][0] + edge[1];
-        dist[edge[0]][1] = mn;
-      }
-    }
-  }
+  for (let i = 0; i < V - 1; i++) {}
 
   return dist;
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 10000, -1 ] to deeply equal [ 4, +0 ]

[Killed] UnaryOperator
src/Dijkstra.js:22:14
   dist[src][0] = 0;
 
   for (let i = 0; i < V - 1; i++) {
-    let mn = -1;
+    let mn = +1;
     for (let j = 0; j < V; j++) {
       if (vis[j] === 0) {
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 10000, -1 ] to deeply equal [ 11, 6 ]

[Killed] ConditionalExpression
src/Dijkstra.js:23:21
 
   for (let i = 0; i < V - 1; i++) {
     let mn = -1;
-    for (let j = 0; j < V; j++) {
+    for (let j = 0; false; j++) {
       if (vis[j] === 0) {
         if (mn === -1 || dist[j][0] < dist[mn][0]) mn = j;
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Dijkstra.js:23:33
 
   for (let i = 0; i < V - 1; i++) {
     let mn = -1;
-    for (let j = 0; j < V; j++) {
-      if (vis[j] === 0) {
-        if (mn === -1 || dist[j][0] < dist[mn][0]) mn = j;
-      }
-    }
+    for (let j = 0; j < V; j++) {}
 
     vis[mn] = 1;
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Dijkstra.js:24:25
   for (let i = 0; i < V - 1; i++) {
     let mn = -1;
     for (let j = 0; j < V; j++) {
-      if (vis[j] === 0) {
-        if (mn === -1 || dist[j][0] < dist[mn][0]) mn = j;
-      }
+      if (vis[j] === 0) {}
     }
 
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/Dijkstra.js:24:11
   for (let i = 0; i < V - 1; i++) {
     let mn = -1;
     for (let j = 0; j < V; j++) {
-      if (vis[j] === 0) {
+      if (vis[j] !== 0) {
         if (mn === -1 || dist[j][0] < dist[mn][0]) mn = j;
       }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] LogicalOperator
src/Dijkstra.js:25:13
     let mn = -1;
     for (let j = 0; j < V; j++) {
       if (vis[j] === 0) {
-        if (mn === -1 || dist[j][0] < dist[mn][0]) mn = j;
+        if (mn === -1 && dist[j][0] < dist[mn][0]) mn = j;
       }
     }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/Dijkstra.js:25:13
     let mn = -1;
     for (let j = 0; j < V; j++) {
       if (vis[j] === 0) {
-        if (mn === -1 || dist[j][0] < dist[mn][0]) mn = j;
+        if (true) mn = j;
       }
     }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 10000, -1 ] to deeply equal [ 4, +0 ]

[Killed] EqualityOperator
src/Dijkstra.js:30:21
     }
 
     vis[mn] = 1;
-    for (let j = 0; j < graph[mn].length; j++) {
+    for (let j = 0; j <= graph[mn].length; j++) {
       const edge = graph[mn][j];
       if (vis[edge[0]] === 0 && dist[edge[0]][0] > dist[mn][0] + edge[1]) {
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/Dijkstra.js:30:21
     }
 
     vis[mn] = 1;
-    for (let j = 0; j < graph[mn].length; j++) {
+    for (let j = 0; false; j++) {
       const edge = graph[mn][j];
       if (vis[edge[0]] === 0 && dist[edge[0]][0] > dist[mn][0] + edge[1]) {
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 10000, -1 ] to deeply equal [ 4, +0 ]

[Killed] ConditionalExpression
src/Dijkstra.js:32:11
     vis[mn] = 1;
     for (let j = 0; j < graph[mn].length; j++) {
       const edge = graph[mn][j];
-      if (vis[edge[0]] === 0 && dist[edge[0]][0] > dist[mn][0] + edge[1]) {
+      if (true) {
         dist[edge[0]][0] = dist[mn][0] + edge[1];
         dist[edge[0]][1] = mn;
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 30, 7 ] to deeply equal [ 4, +0 ]

[Killed] ArithmeticOperator
src/Dijkstra.js:32:52
     vis[mn] = 1;
     for (let j = 0; j < graph[mn].length; j++) {
       const edge = graph[mn][j];
-      if (vis[edge[0]] === 0 && dist[edge[0]][0] > dist[mn][0] + edge[1]) {
+      if (vis[edge[0]] === 0 && dist[edge[0]][0] > dist[mn][0] - edge[1]) {
         dist[edge[0]][0] = dist[mn][0] + edge[1];
         dist[edge[0]][1] = mn;
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ 16, 2 ] to deeply equal [ 11, 6 ]

[Killed] ArithmeticOperator
src/Dijkstra.js:33:28
     for (let j = 0; j < graph[mn].length; j++) {
       const edge = graph[mn][j];
       if (vis[edge[0]] === 0 && dist[edge[0]][0] > dist[mn][0] + edge[1]) {
-        dist[edge[0]][0] = dist[mn][0] + edge[1];
+        dist[edge[0]][0] = dist[mn][0] - edge[1];
         dist[edge[0]][1] = mn;
       }
killedBy: Dijkstra's Algorithm should find the shortest path and distances in the graph
statusReason: expected [ -25, 2 ] to deeply equal [ 4, +0 ]
