[Killed] BlockStatement
src/FloydWarshall.js:1:33
-const FloydWarshall = (dist) => {
-  // Input:- dist: 2D Array where dist[i][j] = edge weight b/w i and j
-  // Output:- dist: 2D Array where dist[i][j] = shortest dist b/w i and j
-  const n = dist.length;
-  for (let k = 0; k < n; k++) {
-    for (let i = 0; i < n; i++) {
-      for (let j = 0; j < n; j++) {
-        if (dist[i][j] > dist[i][k] + dist[k][j]) {
-          // dist from i to j via k is lesser than the current distance
-          dist[i][j] = dist[i][k] + dist[k][j];
-        }
-      }
-    }
-  }
-  return dist;
-};
+const FloydWarshall = (dist) => {};
 
 export { FloydWarshall };
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: expected undefined to deeply equal [ [ +0, 1, 2, 3 ], …(3) ]

[Killed] BlockStatement
src/FloydWarshall.js:5:31
   // Input:- dist: 2D Array where dist[i][j] = edge weight b/w i and j
   // Output:- dist: 2D Array where dist[i][j] = shortest dist b/w i and j
   const n = dist.length;
-  for (let k = 0; k < n; k++) {
-    for (let i = 0; i < n; i++) {
-      for (let j = 0; j < n; j++) {
-        if (dist[i][j] > dist[i][k] + dist[k][j]) {
-          // dist from i to j via k is lesser than the current distance
-          dist[i][j] = dist[i][k] + dist[k][j];
-        }
-      }
-    }
-  }
+  for (let k = 0; k < n; k++) {}
   return dist;
 };
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: expected [ [ +0, 1, 2, Infinity ], …(3) ] to deeply equal [ [ +0, 1, 2, 3 ], …(3) ]

[Killed] EqualityOperator
src/FloydWarshall.js:5:19
   // Input:- dist: 2D Array where dist[i][j] = edge weight b/w i and j
   // Output:- dist: 2D Array where dist[i][j] = shortest dist b/w i and j
   const n = dist.length;
-  for (let k = 0; k < n; k++) {
+  for (let k = 0; k >= n; k++) {
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: expected [ [ +0, 1, 2, Infinity ], …(3) ] to deeply equal [ [ +0, 1, 2, 3 ], …(3) ]

[Killed] UpdateOperator
src/FloydWarshall.js:6:28
   // Output:- dist: 2D Array where dist[i][j] = shortest dist b/w i and j
   const n = dist.length;
   for (let k = 0; k < n; k++) {
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i < n; i--) {
       for (let j = 0; j < n; j++) {
         if (dist[i][j] > dist[i][k] + dist[k][j]) {
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/FloydWarshall.js:6:21
   // Output:- dist: 2D Array where dist[i][j] = shortest dist b/w i and j
   const n = dist.length;
   for (let k = 0; k < n; k++) {
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; false; i++) {
       for (let j = 0; j < n; j++) {
         if (dist[i][j] > dist[i][k] + dist[k][j]) {
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: expected [ [ +0, 1, 2, Infinity ], …(3) ] to deeply equal [ [ +0, 1, 2, 3 ], …(3) ]

[Killed] EqualityOperator
src/FloydWarshall.js:8:13
   for (let k = 0; k < n; k++) {
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
-        if (dist[i][j] > dist[i][k] + dist[k][j]) {
+        if (dist[i][j] <= dist[i][k] + dist[k][j]) {
           // dist from i to j via k is lesser than the current distance
           dist[i][j] = dist[i][k] + dist[k][j];
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: expected [ [ Infinity, Infinity, …(2) ], …(3) ] to deeply equal [ [ +0, 1, 2, 3 ], …(3) ]

[Killed] ConditionalExpression
src/FloydWarshall.js:8:13
   for (let k = 0; k < n; k++) {
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
-        if (dist[i][j] > dist[i][k] + dist[k][j]) {
+        if (false) {
           // dist from i to j via k is lesser than the current distance
           dist[i][j] = dist[i][k] + dist[k][j];
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: expected [ [ +0, 1, 2, Infinity ], …(3) ] to deeply equal [ [ +0, 1, 2, 3 ], …(3) ]

[Killed] ArithmeticOperator
src/FloydWarshall.js:10:24
       for (let j = 0; j < n; j++) {
         if (dist[i][j] > dist[i][k] + dist[k][j]) {
           // dist from i to j via k is lesser than the current distance
-          dist[i][j] = dist[i][k] + dist[k][j];
+          dist[i][j] = dist[i][k] - dist[k][j];
         }
       }
killedBy: Floyd-Warshall Algorithm should find the shortest distances between nodes in the graph
statusReason: expected [ [ +0, 1, 2, 1 ], …(3) ] to deeply equal [ [ +0, 1, 2, 3 ], …(3) ]
