[Killed] BlockStatement
src/InsertionSort.js:1:45
-export function insertionSort(unsortedList) {
-  const len = unsortedList.length;
-  for (let i = 1; i < len; i++) {
-    let j;
-    const tmp = unsortedList[i]; // Copy of the current element.
-    /* Check through the sorted part and compare with the number in tmp. If large, shift the number */
-    for (j = i - 1; j >= 0 && unsortedList[j] > tmp; j--) {
-      // Shift the number
-      unsortedList[j + 1] = unsortedList[j];
-    }
-    // Insert the copied number at the correct position
-    // in sorted part.
-    unsortedList[j + 1] = tmp;
-  }
-}
+export function insertionSort(unsortedList) {}
 
 /**
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ConditionalExpression
src/InsertionSort.js:3:19
 export function insertionSort(unsortedList) {
   const len = unsortedList.length;
-  for (let i = 1; i < len; i++) {
+  for (let i = 1; false; i++) {
     let j;
     const tmp = unsortedList[i]; // Copy of the current element.
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] EqualityOperator
src/InsertionSort.js:3:19
 export function insertionSort(unsortedList) {
   const len = unsortedList.length;
-  for (let i = 1; i < len; i++) {
+  for (let i = 1; i >= len; i++) {
     let j;
     const tmp = unsortedList[i]; // Copy of the current element.
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] BlockStatement
src/InsertionSort.js:7:59
     let j;
     const tmp = unsortedList[i]; // Copy of the current element.
     /* Check through the sorted part and compare with the number in tmp. If large, shift the number */
-    for (j = i - 1; j >= 0 && unsortedList[j] > tmp; j--) {
-      // Shift the number
-      unsortedList[j + 1] = unsortedList[j];
-    }
+    for (j = i - 1; j >= 0 && unsortedList[j] > tmp; j--) {}
     // Insert the copied number at the correct position
     // in sorted part.
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSort
statusReason: expected [ 1, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] EqualityOperator
src/InsertionSort.js:7:21
     let j;
     const tmp = unsortedList[i]; // Copy of the current element.
     /* Check through the sorted part and compare with the number in tmp. If large, shift the number */
-    for (j = i - 1; j >= 0 && unsortedList[j] > tmp; j--) {
+    for (j = i - 1; j < 0 && unsortedList[j] > tmp; j--) {
       // Shift the number
       unsortedList[j + 1] = unsortedList[j];
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSort
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/InsertionSort.js:9:20
     /* Check through the sorted part and compare with the number in tmp. If large, shift the number */
     for (j = i - 1; j >= 0 && unsortedList[j] > tmp; j--) {
       // Shift the number
-      unsortedList[j + 1] = unsortedList[j];
+      unsortedList[j - 1] = unsortedList[j];
     }
     // Insert the copied number at the correct position
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSort
statusReason: expected [ 1, 9, 9, 1, 5, 6, …(1) ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/InsertionSort.js:13:18
     }
     // Insert the copied number at the correct position
     // in sorted part.
-    unsortedList[j + 1] = tmp;
+    unsortedList[j - 1] = tmp;
   }
 }
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSort
statusReason: expected [ 9, 6, 5, 9, 9, 9, …(1) ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] BlockStatement
src/InsertionSort.js:25:63
  * @see [InsertionSort](https://en.wikipedia.org/wiki/Quicksort)
  */
 
-export function insertionSortAlternativeImplementation(array) {
-  const length = array.length;
-  if (length < 2) return array;
-
-  for (let i = 1; i < length; i++) {
-    // Take current element in array
-    const currentItem = array[i];
-    // Take index of previous element in array
-    let j = i - 1;
-
-    // While j >= 0 and previous element is greater than current element
-    while (j >= 0 && array[j] > currentItem) {
-      // Move previous, greater element towards the unsorted part
-      array[j + 1] = array[j];
-      j--;
-    }
-    // Insert currentItem number at the correct position in sorted part.
-    array[j + 1] = currentItem;
-  }
-  // Return array sorted in ascending order
-  return array;
-}
+export function insertionSortAlternativeImplementation(array) {}
 
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected undefined to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] EqualityOperator
src/InsertionSort.js:27:7
 
 export function insertionSortAlternativeImplementation(array) {
   const length = array.length;
-  if (length < 2) return array;
+  if (length <= 2) return array;
 
   for (let i = 1; i < length; i++) {
killedBy: insertionSortAlternativeImplementation expects to return array sorted in ascending order
statusReason: expected [ 14, 11 ] to deeply equal [ 11, 14 ]

[Killed] ConditionalExpression
src/InsertionSort.js:27:7
 
 export function insertionSortAlternativeImplementation(array) {
   const length = array.length;
-  if (length < 2) return array;
+  if (true) return array;
 
   for (let i = 1; i < length; i++) {
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] EqualityOperator
src/InsertionSort.js:29:19
   const length = array.length;
   if (length < 2) return array;
 
-  for (let i = 1; i < length; i++) {
+  for (let i = 1; i <= length; i++) {
     // Take current element in array
     const currentItem = array[i];
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 1, 2, 5, 5, 6, 9, undefined ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ConditionalExpression
src/InsertionSort.js:29:19
   const length = array.length;
   if (length < 2) return array;
 
-  for (let i = 1; i < length; i++) {
+  for (let i = 1; false; i++) {
     // Take current element in array
     const currentItem = array[i];
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 5, 2, 9, 1, 5, 6 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/InsertionSort.js:33:13
     // Take current element in array
     const currentItem = array[i];
     // Take index of previous element in array
-    let j = i - 1;
+    let j = i + 1;
 
     // While j >= 0 and previous element is greater than current element
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 5, 2, 2, 2, 2, 2, 2, 9 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] EqualityOperator
src/InsertionSort.js:36:22
     let j = i - 1;
 
     // While j >= 0 and previous element is greater than current element
-    while (j >= 0 && array[j] > currentItem) {
+    while (j >= 0 && array[j] <= currentItem) {
       // Move previous, greater element towards the unsorted part
       array[j + 1] = array[j];
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 9, 6, 5, 5, 2, 1 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] EqualityOperator
src/InsertionSort.js:36:12
     let j = i - 1;
 
     // While j >= 0 and previous element is greater than current element
-    while (j >= 0 && array[j] > currentItem) {
+    while (j > 0 && array[j] > currentItem) {
       // Move previous, greater element towards the unsorted part
       array[j + 1] = array[j];
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 5, 1, 2, 5, 6, 9 ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Killed] ArithmeticOperator
src/InsertionSort.js:38:13
     // While j >= 0 and previous element is greater than current element
     while (j >= 0 && array[j] > currentItem) {
       // Move previous, greater element towards the unsorted part
-      array[j + 1] = array[j];
+      array[j - 1] = array[j];
       j--;
     }
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 1, 9, 9, 1, 5, 6, …(1) ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]

[Timeout] UpdateOperator
src/InsertionSort.js:39:7
     while (j >= 0 && array[j] > currentItem) {
       // Move previous, greater element towards the unsorted part
       array[j + 1] = array[j];
-      j--;
+      j++;
     }
     // Insert currentItem number at the correct position in sorted part.

[Killed] ArithmeticOperator
src/InsertionSort.js:42:11
       j--;
     }
     // Insert currentItem number at the correct position in sorted part.
-    array[j + 1] = currentItem;
+    array[j - 1] = currentItem;
   }
   // Return array sorted in ascending order
killedBy: insertionSortAlternativeImplementation should sort an array using insertionSortAlternativeImplementation
statusReason: expected [ 9, 6, 5, 9, 9, 9, …(1) ] to deeply equal [ 1, 2, 5, 5, 6, 9 ]
