[Killed] BlockStatement
src/Kosaraju.js:2:22
 class Kosaraju {
-  constructor(graph) {
-    this.connections = {};
-    this.reverseConnections = {};
-    this.stronglyConnectedComponents = [];
-    for (const [i, j] of graph) {
-      this.addEdge(i, j);
-    }
-    this.topoSort();
-    return this.kosaraju();
-  }
+  constructor(graph) {}
 
   addNode(node) {
killedBy: Kosaraju Function Test Case 1
statusReason: expected Kosaraju{} to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ArrayDeclaration
src/Kosaraju.js:5:40
   constructor(graph) {
     this.connections = {};
     this.reverseConnections = {};
-    this.stronglyConnectedComponents = [];
+    this.stronglyConnectedComponents = ["Stryker was here"];
     for (const [i, j] of graph) {
       this.addEdge(i, j);
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ 'Stryker was here', …(2) ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] BlockStatement
src/Kosaraju.js:6:33
     this.connections = {};
     this.reverseConnections = {};
     this.stronglyConnectedComponents = [];
-    for (const [i, j] of graph) {
-      this.addEdge(i, j);
-    }
+    for (const [i, j] of graph) {}
     this.topoSort();
     return this.kosaraju();
killedBy: Kosaraju Function Test Case 1
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Kosaraju.js:13:17
     return this.kosaraju();
   }
 
-  addNode(node) {
-    // Function to add a node to the graph (connection represented by set)
-    this.connections[node] = new Set();
-    this.reverseConnections[node] = new Set();
-    this.topoSorted = [];
-  }
+  addNode(node) {}
 
   addEdge(node1, node2) {
killedBy: Kosaraju Function Test Case 1
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] BlockStatement
src/Kosaraju.js:20:25
     this.topoSorted = [];
   }
 
-  addEdge(node1, node2) {
-    // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections) || !(node1 in this.reverseConnections)) {
-      this.addNode(node1);
-    }
-    if (!(node2 in this.connections) || !(node2 in this.reverseConnections)) {
-      this.addNode(node2);
-    }
-    this.connections[node1].add(node2);
-    this.reverseConnections[node2].add(node1);
-  }
+  addEdge(node1, node2) {}
 
   dfsTopoSort(node, visited) {
killedBy: Kosaraju Function Test Case 1
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Kosaraju.js:22:78
 
   addEdge(node1, node2) {
     // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections) || !(node1 in this.reverseConnections)) {
-      this.addNode(node1);
-    }
+    if (!(node1 in this.connections) || !(node1 in this.reverseConnections)) {}
     if (!(node2 in this.connections) || !(node2 in this.reverseConnections)) {
       this.addNode(node2);
killedBy: Kosaraju Function Test Case 1
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] ConditionalExpression
src/Kosaraju.js:22:9
 
   addEdge(node1, node2) {
     // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections) || !(node1 in this.reverseConnections)) {
+    if (true) {
       this.addNode(node1);
     }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ Array(5) ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] BooleanLiteral
src/Kosaraju.js:25:41
     if (!(node1 in this.connections) || !(node1 in this.reverseConnections)) {
       this.addNode(node1);
     }
-    if (!(node2 in this.connections) || !(node2 in this.reverseConnections)) {
+    if (!(node2 in this.connections) || node2 in this.reverseConnections) {
       this.addNode(node2);
     }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 5, 4, 6 ], [ 2, 1, 3 ] ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ConditionalExpression
src/Kosaraju.js:25:9
     if (!(node1 in this.connections) || !(node1 in this.reverseConnections)) {
       this.addNode(node1);
     }
-    if (!(node2 in this.connections) || !(node2 in this.reverseConnections)) {
+    if (true) {
       this.addNode(node2);
     }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 5, 4, 6 ], [ 2, 1, 3 ] ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] BlockStatement
src/Kosaraju.js:32:30
     this.reverseConnections[node2].add(node1);
   }
 
-  dfsTopoSort(node, visited) {
-    visited.add(node);
-    for (const child of this.connections[node]) {
-      if (!visited.has(child)) this.dfsTopoSort(child, visited);
-    }
-    this.topoSorted.push(node);
-  }
+  dfsTopoSort(node, visited) {}
 
   topoSort() {
killedBy: Kosaraju Function Test Case 1
statusReason: expected [] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] BlockStatement
src/Kosaraju.js:34:49
 
   dfsTopoSort(node, visited) {
     visited.add(node);
-    for (const child of this.connections[node]) {
-      if (!visited.has(child)) this.dfsTopoSort(child, visited);
-    }
+    for (const child of this.connections[node]) {}
     this.topoSorted.push(node);
   }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 6, 5, 4, 2, 1, 3 ] ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ConditionalExpression
src/Kosaraju.js:35:11
   dfsTopoSort(node, visited) {
     visited.add(node);
     for (const child of this.connections[node]) {
-      if (!visited.has(child)) this.dfsTopoSort(child, visited);
+      if (false) this.dfsTopoSort(child, visited);
     }
     this.topoSorted.push(node);
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 6, 5, 4, 2, 1, 3 ] ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Timeout] BooleanLiteral
src/Kosaraju.js:35:11
   dfsTopoSort(node, visited) {
     visited.add(node);
     for (const child of this.connections[node]) {
-      if (!visited.has(child)) this.dfsTopoSort(child, visited);
+      if (visited.has(child)) this.dfsTopoSort(child, visited);
     }
     this.topoSorted.push(node);

[Killed] BlockStatement
src/Kosaraju.js:40:14
     this.topoSorted.push(node);
   }
 
-  topoSort() {
-    // Function to perform topological sorting
-    const visited = new Set();
-    const nodes = Object.keys(this.connections).map((key) => Number(key));
-    for (const node of nodes) {
-      if (!visited.has(node)) this.dfsTopoSort(node, visited);
-    }
-  }
+  topoSort() {}
 
   dfsKosaraju(node, visited) {
killedBy: Kosaraju Function Test Case 1
statusReason: expected [] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ArrowFunction
src/Kosaraju.js:43:53
   topoSort() {
     // Function to perform topological sorting
     const visited = new Set();
-    const nodes = Object.keys(this.connections).map((key) => Number(key));
+    const nodes = Object.keys(this.connections).map(() => undefined);
     for (const node of nodes) {
       if (!visited.has(node)) this.dfsTopoSort(node, visited);
killedBy: Kosaraju Function Test Case 1
statusReason: this.connections[node] is not iterable

[Killed] BlockStatement
src/Kosaraju.js:44:31
     // Function to perform topological sorting
     const visited = new Set();
     const nodes = Object.keys(this.connections).map((key) => Number(key));
-    for (const node of nodes) {
-      if (!visited.has(node)) this.dfsTopoSort(node, visited);
-    }
+    for (const node of nodes) {}
   }
 
killedBy: Kosaraju Function Test Case 1
statusReason: expected [] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ConditionalExpression
src/Kosaraju.js:45:11
     const visited = new Set();
     const nodes = Object.keys(this.connections).map((key) => Number(key));
     for (const node of nodes) {
-      if (!visited.has(node)) this.dfsTopoSort(node, visited);
+      if (false) this.dfsTopoSort(node, visited);
     }
   }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ConditionalExpression
src/Kosaraju.js:45:11
     const visited = new Set();
     const nodes = Object.keys(this.connections).map((key) => Number(key));
     for (const node of nodes) {
-      if (!visited.has(node)) this.dfsTopoSort(node, visited);
+      if (true) this.dfsTopoSort(node, visited);
     }
   }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 6, 5, 4, 2, 1, 3 ] ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] BlockStatement
src/Kosaraju.js:49:30
     }
   }
 
-  dfsKosaraju(node, visited) {
-    visited.add(node);
-    this.stronglyConnectedComponents[
-      this.stronglyConnectedComponents.length - 1
-    ].push(node);
-    for (const child of this.reverseConnections[node]) {
-      if (!visited.has(child)) this.dfsKosaraju(child, visited);
-    }
-  }
+  dfsKosaraju(node, visited) {}
 
   kosaraju() {
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [], [], [], [], [], [] ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ArithmeticOperator
src/Kosaraju.js:52:7
   dfsKosaraju(node, visited) {
     visited.add(node);
     this.stronglyConnectedComponents[
-      this.stronglyConnectedComponents.length - 1
+      this.stronglyConnectedComponents.length + 1
     ].push(node);
     for (const child of this.reverseConnections[node]) {
killedBy: Kosaraju Function Test Case 1
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/Kosaraju.js:54:56
     this.stronglyConnectedComponents[
       this.stronglyConnectedComponents.length - 1
     ].push(node);
-    for (const child of this.reverseConnections[node]) {
-      if (!visited.has(child)) this.dfsKosaraju(child, visited);
-    }
+    for (const child of this.reverseConnections[node]) {}
   }
 
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 1 ], [ 2 ], [ 4 ], [ 5 ], …(2) ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ConditionalExpression
src/Kosaraju.js:55:11
       this.stronglyConnectedComponents.length - 1
     ].push(node);
     for (const child of this.reverseConnections[node]) {
-      if (!visited.has(child)) this.dfsKosaraju(child, visited);
+      if (false) this.dfsKosaraju(child, visited);
     }
   }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 1 ], [ 2 ], [ 4 ], [ 5 ], …(2) ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Timeout] BooleanLiteral
src/Kosaraju.js:55:11
       this.stronglyConnectedComponents.length - 1
     ].push(node);
     for (const child of this.reverseConnections[node]) {
-      if (!visited.has(child)) this.dfsKosaraju(child, visited);
+      if (visited.has(child)) this.dfsKosaraju(child, visited);
     }
   }

[Killed] BlockStatement
src/Kosaraju.js:59:14
     }
   }
 
-  kosaraju() {
-    // Function to perform Kosaraju Algorithm
-    const visited = new Set();
-    while (this.topoSorted.length > 0) {
-      const node = this.topoSorted.pop();
-      if (!visited.has(node)) {
-        this.stronglyConnectedComponents.push([]);
-        this.dfsKosaraju(node, visited);
-      }
-    }
-    return this.stronglyConnectedComponents;
-  }
+  kosaraju() {}
 }
 
killedBy: Kosaraju Function Test Case 1
statusReason: expected Kosaraju{ connections: { …(6) }, …(3) } to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ConditionalExpression
src/Kosaraju.js:62:12
   kosaraju() {
     // Function to perform Kosaraju Algorithm
     const visited = new Set();
-    while (this.topoSorted.length > 0) {
+    while (false) {
       const node = this.topoSorted.pop();
       if (!visited.has(node)) {
killedBy: Kosaraju Function Test Case 1
statusReason: expected [] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] EqualityOperator
src/Kosaraju.js:62:12
   kosaraju() {
     // Function to perform Kosaraju Algorithm
     const visited = new Set();
-    while (this.topoSorted.length > 0) {
+    while (this.topoSorted.length >= 0) {
       const node = this.topoSorted.pop();
       if (!visited.has(node)) {
killedBy: Kosaraju Function Test Case 1
statusReason: this.reverseConnections[node] is not iterable

[Killed] ConditionalExpression
src/Kosaraju.js:64:11
     const visited = new Set();
     while (this.topoSorted.length > 0) {
       const node = this.topoSorted.pop();
-      if (!visited.has(node)) {
+      if (false) {
         this.stronglyConnectedComponents.push([]);
         this.dfsKosaraju(node, visited);
killedBy: Kosaraju Function Test Case 1
statusReason: expected [] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ConditionalExpression
src/Kosaraju.js:64:11
     const visited = new Set();
     while (this.topoSorted.length > 0) {
       const node = this.topoSorted.pop();
-      if (!visited.has(node)) {
+      if (true) {
         this.stronglyConnectedComponents.push([]);
         this.dfsKosaraju(node, visited);
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ [ 1, 3, 2 ], [ 2 ], …(4) ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] ArrayDeclaration
src/Kosaraju.js:65:47
     while (this.topoSorted.length > 0) {
       const node = this.topoSorted.pop();
       if (!visited.has(node)) {
-        this.stronglyConnectedComponents.push([]);
+        this.stronglyConnectedComponents.push(["Stryker was here"]);
         this.dfsKosaraju(node, visited);
       }
killedBy: Kosaraju Function Test Case 1
statusReason: expected [ …(2) ] to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]

[Killed] BlockStatement
src/Kosaraju.js:73:26
   }
 }
 
-function kosaraju(graph) {
-  const stronglyConnectedComponents = new Kosaraju(graph);
-  return stronglyConnectedComponents;
-}
+function kosaraju(graph) {}
 
 export { kosaraju };
killedBy: Kosaraju Function Test Case 1
statusReason: expected undefined to deeply equal [ [ 1, 3, 2 ], [ 4, 6, 5 ] ]
