[Killed] BlockStatement
src/MergeSort.js:8:37
  * @param {Array} list2 Sublist to break down.
  * @return {Array} The merged list.
  */
-export function merge(list1, list2) {
-  const results = [];
-  let i = 0;
-  let j = 0;
-
-  while (i < list1.length && j < list2.length) {
-    if (list1[i] < list2[j]) {
-      results.push(list1[i++]);
-    } else {
-      results.push(list2[j++]);
-    }
-  }
-
-  return results.concat(list1.slice(i), list2.slice(j));
-}
+export function merge(list1, list2) {}
 
 /**
killedBy: merge should merge arrays correctly
statusReason: expected undefined to deeply equal [ 1, 2, 3, 5, 4 ]

[Killed] ConditionalExpression
src/MergeSort.js:13:10
   let i = 0;
   let j = 0;
 
-  while (i < list1.length && j < list2.length) {
+  while (false) {
     if (list1[i] < list2[j]) {
       results.push(list1[i++]);
killedBy: merge should merge arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 5, 4 ]

[Killed] EqualityOperator
src/MergeSort.js:13:10
   let i = 0;
   let j = 0;
 
-  while (i < list1.length && j < list2.length) {
+  while (i >= list1.length && j < list2.length) {
     if (list1[i] < list2[j]) {
       results.push(list1[i++]);
killedBy: merge should merge arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 5, 4 ]

[Killed] ConditionalExpression
src/MergeSort.js:14:9
   let j = 0;
 
   while (i < list1.length && j < list2.length) {
-    if (list1[i] < list2[j]) {
+    if (false) {
       results.push(list1[i++]);
     } else {
killedBy: MergeSort should sort arrays correctly
statusReason: expected [ 9, 15, 10, 4, 8 ] to deeply equal [ 4, 8, 9, 10, 15 ]

[Killed] EqualityOperator
src/MergeSort.js:14:9
   let j = 0;
 
   while (i < list1.length && j < list2.length) {
-    if (list1[i] < list2[j]) {
+    if (list1[i] >= list2[j]) {
       results.push(list1[i++]);
     } else {
killedBy: merge should merge arrays correctly
statusReason: expected [ 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 5, 4 ]

[Killed] UpdateOperator
src/MergeSort.js:15:26
 
   while (i < list1.length && j < list2.length) {
     if (list1[i] < list2[j]) {
-      results.push(list1[i++]);
+      results.push(list1[i--]);
     } else {
       results.push(list2[j++]);
killedBy: MergeSort should sort arrays correctly
statusReason: expected [ 4, 9, 10, 15, 10, 8 ] to deeply equal [ 4, 8, 9, 10, 15 ]

[Timeout] BlockStatement
src/MergeSort.js:16:12
   while (i < list1.length && j < list2.length) {
     if (list1[i] < list2[j]) {
       results.push(list1[i++]);
-    } else {
-      results.push(list2[j++]);
-    }
+    } else {}
   }
 

[Timeout] UpdateOperator
src/MergeSort.js:17:26
     if (list1[i] < list2[j]) {
       results.push(list1[i++]);
     } else {
-      results.push(list2[j++]);
+      results.push(list2[j--]);
     }
   }

[Killed] MethodExpression
src/MergeSort.js:21:41
     }
   }
 
-  return results.concat(list1.slice(i), list2.slice(j));
+  return results.concat(list1.slice(i), list2);
 }
 
killedBy: merge should merge arrays correctly
statusReason: expected [ 1, 2, 3, 5, 4, 1, 2, 3 ] to deeply equal [ 1, 2, 3, 5, 4 ]

[Killed] MethodExpression
src/MergeSort.js:21:25
     }
   }
 
-  return results.concat(list1.slice(i), list2.slice(j));
+  return results.concat(list1, list2.slice(j));
 }
 
killedBy: MergeSort should sort arrays correctly
statusReason: expected [ 4, 8, 4, 8, 9, 10, 10, 15 ] to deeply equal [ 4, 8, 9, 10, 15 ]

[Killed] BlockStatement
src/MergeSort.js:30:33
  * @param {Array} list List to be sorted.
  * @return {Array} The sorted list.
  */
-export function mergeSort(list) {
-  if (list.length < 2) return list;
-
-  const listHalf = Math.floor(list.length / 2);
-  const subList1 = list.slice(0, listHalf);
-  const subList2 = list.slice(listHalf, list.length);
-
-  return merge(mergeSort(subList1), mergeSort(subList2));
-}
+export function mergeSort(list) {}
 
killedBy: MergeSort should work for empty arrays
statusReason: expected undefined to deeply equal []

[Killed] EqualityOperator
src/MergeSort.js:31:7
  * @return {Array} The sorted list.
  */
 export function mergeSort(list) {
-  if (list.length < 2) return list;
+  if (list.length <= 2) return list;
 
   const listHalf = Math.floor(list.length / 2);
killedBy: MergeSort should sort arrays correctly
statusReason: expected [ 5, 4 ] to deeply equal [ 4, 5 ]

[Killed] ConditionalExpression
src/MergeSort.js:31:7
  * @return {Array} The sorted list.
  */
 export function mergeSort(list) {
-  if (list.length < 2) return list;
+  if (true) return list;
 
   const listHalf = Math.floor(list.length / 2);
killedBy: MergeSort should sort arrays correctly
statusReason: expected [ 5, 4 ] to deeply equal [ 4, 5 ]

[Timeout] ArithmeticOperator
src/MergeSort.js:33:31
 export function mergeSort(list) {
   if (list.length < 2) return list;
 
-  const listHalf = Math.floor(list.length / 2);
+  const listHalf = Math.floor(list.length * 2);
   const subList1 = list.slice(0, listHalf);
   const subList2 = list.slice(listHalf, list.length);

[Timeout] MethodExpression
src/MergeSort.js:34:20
   if (list.length < 2) return list;
 
   const listHalf = Math.floor(list.length / 2);
-  const subList1 = list.slice(0, listHalf);
+  const subList1 = list;
   const subList2 = list.slice(listHalf, list.length);
 

[Timeout] MethodExpression
src/MergeSort.js:35:20
 
   const listHalf = Math.floor(list.length / 2);
   const subList1 = list.slice(0, listHalf);
-  const subList2 = list.slice(listHalf, list.length);
+  const subList2 = list;
 
   return merge(mergeSort(subList1), mergeSort(subList2));
