[Killed] BlockStatement
src/NumberOfIslands.js:5:31
   const matrix = matrixGrid;
   let counter = 0;
 
-  const flood = (row, col) => {
-    if (row < 0 || col < 0) return; // Off the map above or left
-    if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
-
-    const tile = matrix[row][col];
-    if (tile !== "1") return;
-
-    matrix[row][col] = "0";
-
-    flood(row + 1, col); // Down
-    flood(row - 1, col); // Up
-    flood(row, col + 1); // Right
-    flood(row, col - 1); // Left
-  };
+  const flood = (row, col) => {};
 
   for (let row = 0; row < matrix.length; row += 1) {
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 7 to deeply equal 3

[Killed] ConditionalExpression
src/NumberOfIslands.js:6:9
   let counter = 0;
 
   const flood = (row, col) => {
-    if (row < 0 || col < 0) return; // Off the map above or left
+    if (true) return; // Off the map above or left
     if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
 
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 7 to deeply equal 3

[Killed] EqualityOperator
src/NumberOfIslands.js:6:20
   let counter = 0;
 
   const flood = (row, col) => {
-    if (row < 0 || col < 0) return; // Off the map above or left
+    if (row < 0 || col >= 0) return; // Off the map above or left
     if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
 
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 7 to deeply equal 3

[Killed] ConditionalExpression
src/NumberOfIslands.js:7:9
 
   const flood = (row, col) => {
     if (row < 0 || col < 0) return; // Off the map above or left
-    if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
+    if (true) return; // Off the map below or right
 
     const tile = matrix[row][col];
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 7 to deeply equal 3

[Killed] ConditionalExpression
src/NumberOfIslands.js:7:9
 
   const flood = (row, col) => {
     if (row < 0 || col < 0) return; // Off the map above or left
-    if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
+    if (false) return; // Off the map below or right
 
     const tile = matrix[row][col];
killedBy: Number of Islands should count three islands in the graph
statusReason: Cannot read properties of undefined (reading '3')

[Killed] EqualityOperator
src/NumberOfIslands.js:10:9
     if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
 
     const tile = matrix[row][col];
-    if (tile !== "1") return;
+    if (tile === "1") return;
 
     matrix[row][col] = "0";
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 7 to deeply equal 3

[Killed] ConditionalExpression
src/NumberOfIslands.js:10:9
     if (row >= matrix.length || col >= matrix[row].length) return; // Off the map below or right
 
     const tile = matrix[row][col];
-    if (tile !== "1") return;
+    if (true) return;
 
     matrix[row][col] = "0";
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 7 to deeply equal 3

[Killed] ArithmeticOperator
src/NumberOfIslands.js:14:11
 
     matrix[row][col] = "0";
 
-    flood(row + 1, col); // Down
+    flood(row - 1, col); // Down
     flood(row - 1, col); // Up
     flood(row, col + 1); // Right
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 4 to deeply equal 3

[Survived] ArithmeticOperator
src/NumberOfIslands.js:15:11
     matrix[row][col] = "0";
 
     flood(row + 1, col); // Down
-    flood(row - 1, col); // Up
+    flood(row + 1, col); // Up
     flood(row, col + 1); // Right
     flood(row, col - 1); // Left

[Killed] ArithmeticOperator
src/NumberOfIslands.js:16:16
 
     flood(row + 1, col); // Down
     flood(row - 1, col); // Up
-    flood(row, col + 1); // Right
+    flood(row, col - 1); // Right
     flood(row, col - 1); // Left
   };
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 5 to deeply equal 3

[Survived] ArithmeticOperator
src/NumberOfIslands.js:17:16
     flood(row + 1, col); // Down
     flood(row - 1, col); // Up
     flood(row, col + 1); // Right
-    flood(row, col - 1); // Left
+    flood(row, col + 1); // Left
   };
 

[Killed] AssignmentOperator
src/NumberOfIslands.js:20:42
     flood(row, col - 1); // Left
   };
 
-  for (let row = 0; row < matrix.length; row += 1) {
+  for (let row = 0; row < matrix.length; row -= 1) {
     for (let col = 0; col < matrix[row].length; col += 1) {
       const current = matrix[row][col];
killedBy: Number of Islands should count three islands in the graph
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/NumberOfIslands.js:20:21
     flood(row, col - 1); // Left
   };
 
-  for (let row = 0; row < matrix.length; row += 1) {
+  for (let row = 0; row >= matrix.length; row += 1) {
     for (let col = 0; col < matrix[row].length; col += 1) {
       const current = matrix[row][col];
killedBy: Number of Islands should count three islands in the graph
statusReason: expected +0 to deeply equal 3

[Killed] EqualityOperator
src/NumberOfIslands.js:21:23
   };
 
   for (let row = 0; row < matrix.length; row += 1) {
-    for (let col = 0; col < matrix[row].length; col += 1) {
+    for (let col = 0; col >= matrix[row].length; col += 1) {
       const current = matrix[row][col];
       if (current === "1") {
killedBy: Number of Islands should count three islands in the graph
statusReason: expected +0 to deeply equal 3

[Killed] BlockStatement
src/NumberOfIslands.js:21:59
   };
 
   for (let row = 0; row < matrix.length; row += 1) {
-    for (let col = 0; col < matrix[row].length; col += 1) {
-      const current = matrix[row][col];
-      if (current === "1") {
-        flood(row, col);
-        counter += 1;
-      }
-    }
+    for (let col = 0; col < matrix[row].length; col += 1) {}
   }
   return counter;
killedBy: Number of Islands should count three islands in the graph
statusReason: expected +0 to deeply equal 3

[Killed] EqualityOperator
src/NumberOfIslands.js:23:11
   for (let row = 0; row < matrix.length; row += 1) {
     for (let col = 0; col < matrix[row].length; col += 1) {
       const current = matrix[row][col];
-      if (current === "1") {
+      if (current !== "1") {
         flood(row, col);
         counter += 1;
killedBy: Number of Islands should count three islands in the graph
statusReason: expected 13 to deeply equal 3

[Killed] BlockStatement
src/NumberOfIslands.js:23:28
   for (let row = 0; row < matrix.length; row += 1) {
     for (let col = 0; col < matrix[row].length; col += 1) {
       const current = matrix[row][col];
-      if (current === "1") {
-        flood(row, col);
-        counter += 1;
-      }
+      if (current === "1") {}
     }
   }
killedBy: Number of Islands should count three islands in the graph
statusReason: expected +0 to deeply equal 3

[Killed] AssignmentOperator
src/NumberOfIslands.js:25:9
       const current = matrix[row][col];
       if (current === "1") {
         flood(row, col);
-        counter += 1;
+        counter -= 1;
       }
     }
killedBy: Number of Islands should count three islands in the graph
statusReason: expected -3 to deeply equal 3
