[Killed] BlockStatement
src/QuickSort.js:8:27
  * @return {Integer[]} - Sorted array.
  * @see [QuickSort](https://en.wikipedia.org/wiki/Quicksort)
  */
-function quickSort(items) {
-  const length = items.length
-
-  if (length <= 1) {
-    return items
-  }
-  const PIVOT = items[0]
-  const GREATER = []
-  const LESSER = []
-
-  for (let i = 1; i < length; i++) {
-    if (items[i] > PIVOT) {
-      GREATER.push(items[i])
-    } else {
-      LESSER.push(items[i])
-    }
-  }
-
-  const sorted = [...quickSort(LESSER), PIVOT, ...quickSort(GREATER)]
-  return sorted
-}
+function quickSort(items) {}
 
 export { quickSort }
killedBy: QuickSort should work for empty arrays
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/QuickSort.js:11:7
 function quickSort(items) {
   const length = items.length
 
-  if (length <= 1) {
+  if (true) {
     return items
   }
killedBy: QuickSort should sort arrays correctly
statusReason: expected [ 5, 4, 3, 10, 2, 1 ] to deeply equal [ 1, 2, 3, 4, 5, 10 ]

[Timeout] ConditionalExpression
src/QuickSort.js:11:7
 function quickSort(items) {
   const length = items.length
 
-  if (length <= 1) {
+  if (false) {
     return items
   }

[Killed] ArrayDeclaration
src/QuickSort.js:15:19
     return items
   }
   const PIVOT = items[0]
-  const GREATER = []
+  const GREATER = ["Stryker was here"]
   const LESSER = []
 
killedBy: QuickSort should sort arrays correctly
statusReason: expected [ 1, 2, 'Stryker was here', 3, …(7) ] to deeply equal [ 1, 2, 3, 4, 5, 10 ]

[Timeout] ArrayDeclaration
src/QuickSort.js:16:18
   }
   const PIVOT = items[0]
   const GREATER = []
-  const LESSER = []
+  const LESSER = ["Stryker was here"]
 
   for (let i = 1; i < length; i++) {

[Killed] EqualityOperator
src/QuickSort.js:18:19
   const GREATER = []
   const LESSER = []
 
-  for (let i = 1; i < length; i++) {
+  for (let i = 1; i >= length; i++) {
     if (items[i] > PIVOT) {
       GREATER.push(items[i])
killedBy: QuickSort should sort arrays correctly
statusReason: expected [ 5 ] to deeply equal [ 1, 2, 3, 4, 5, 10 ]

[Killed] BlockStatement
src/QuickSort.js:18:36
   const GREATER = []
   const LESSER = []
 
-  for (let i = 1; i < length; i++) {
-    if (items[i] > PIVOT) {
-      GREATER.push(items[i])
-    } else {
-      LESSER.push(items[i])
-    }
-  }
+  for (let i = 1; i < length; i++) {}
 
   const sorted = [...quickSort(LESSER), PIVOT, ...quickSort(GREATER)]
killedBy: QuickSort should sort arrays correctly
statusReason: expected [ 5 ] to deeply equal [ 1, 2, 3, 4, 5, 10 ]

[Killed] EqualityOperator
src/QuickSort.js:19:9
   const LESSER = []
 
   for (let i = 1; i < length; i++) {
-    if (items[i] > PIVOT) {
+    if (items[i] <= PIVOT) {
       GREATER.push(items[i])
     } else {
killedBy: QuickSort should sort arrays correctly
statusReason: expected [ 10, 5, 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4, 5, 10 ]

[Killed] ConditionalExpression
src/QuickSort.js:19:9
   const LESSER = []
 
   for (let i = 1; i < length; i++) {
-    if (items[i] > PIVOT) {
+    if (true) {
       GREATER.push(items[i])
     } else {
killedBy: QuickSort should sort arrays correctly
statusReason: expected [ 5, 4, 3, 10, 2, 1 ] to deeply equal [ 1, 2, 3, 4, 5, 10 ]

[Killed] BlockStatement
src/QuickSort.js:21:12
   for (let i = 1; i < length; i++) {
     if (items[i] > PIVOT) {
       GREATER.push(items[i])
-    } else {
-      LESSER.push(items[i])
-    }
+    } else {}
   }
 
killedBy: QuickSort should sort arrays correctly
statusReason: expected [ 5, 10 ] to deeply equal [ 1, 2, 3, 4, 5, 10 ]
