[Killed] BlockStatement
src/QuickSortRecursive.js:7:45
  * @param {number} low lower index for partition.
  * @param {number} high higher index for partition.
  */
-const quickSort = (inputList, low, high) => {
-  if (!Array.isArray(inputList)) {
-    throw new TypeError("Please input a valid list or array.");
-  }
-  if (low < high) {
-    // get the partition index.
-    const pIndex = partition(inputList, low, high);
-    // recursively call the quickSort method again.
-    quickSort(inputList, low, pIndex - 1);
-    quickSort(inputList, pIndex + 1, high);
-  }
-  return inputList;
-};
+const quickSort = (inputList, low, high) => {};
 
 /**
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, throw some error if we pass a non-array input
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/QuickSortRecursive.js:8:7
  * @param {number} high higher index for partition.
  */
 const quickSort = (inputList, low, high) => {
-  if (!Array.isArray(inputList)) {
+  if (false) {
     throw new TypeError("Please input a valid list or array.");
   }
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, throw some error if we pass a non-array input
statusReason: expected [Function] to throw error including 'Please input a valid list or array.' but got 'Cannot assign to read only property \…'

[Killed] ConditionalExpression
src/QuickSortRecursive.js:8:7
  * @param {number} high higher index for partition.
  */
 const quickSort = (inputList, low, high) => {
-  if (!Array.isArray(inputList)) {
+  if (true) {
     throw new TypeError("Please input a valid list or array.");
   }
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: Please input a valid list or array.

[Killed] ConditionalExpression
src/QuickSortRecursive.js:11:7
   if (!Array.isArray(inputList)) {
     throw new TypeError("Please input a valid list or array.");
   }
-  if (low < high) {
+  if (false) {
     // get the partition index.
     const pIndex = partition(inputList, low, high);
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ 5, 9, 3, 4, 6, 2, +0, 1, 7, 8 ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Killed] EqualityOperator
src/QuickSortRecursive.js:11:7
   if (!Array.isArray(inputList)) {
     throw new TypeError("Please input a valid list or array.");
   }
-  if (low < high) {
+  if (low >= high) {
     // get the partition index.
     const pIndex = partition(inputList, low, high);
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ 5, 9, 3, 4, 6, 2, +0, 1, 7, 8 ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Timeout] ArithmeticOperator
src/QuickSortRecursive.js:15:31
     // get the partition index.
     const pIndex = partition(inputList, low, high);
     // recursively call the quickSort method again.
-    quickSort(inputList, low, pIndex - 1);
+    quickSort(inputList, low, pIndex + 1);
     quickSort(inputList, pIndex + 1, high);
   }

[Timeout] ArithmeticOperator
src/QuickSortRecursive.js:16:26
     const pIndex = partition(inputList, low, high);
     // recursively call the quickSort method again.
     quickSort(inputList, low, pIndex - 1);
-    quickSort(inputList, pIndex + 1, high);
+    quickSort(inputList, pIndex - 1, high);
   }
   return inputList;

[Killed] BlockStatement
src/QuickSortRecursive.js:28:49
  * @param {number} high higher index for partition.
  * @returns {number} `pIndex` pivot index value.
  */
-const partition = (partitionList, low, high) => {
-  const pivot = partitionList[high];
-  let pIndex = low;
-  for (let index = low; index <= high - 1; index++) {
-    if (partitionList[index] < pivot) {
-      // swap variables using array destructuring
-      [partitionList[index], partitionList[pIndex]] = [
-        partitionList[pIndex],
-        partitionList[index],
-      ];
-      pIndex += 1;
-    }
-  }
-  [partitionList[pIndex], partitionList[high]] = [
-    partitionList[high],
-    partitionList[pIndex],
-  ];
-  return pIndex;
-};
+const partition = (partitionList, low, high) => {};
 
 export { quickSort };
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ 5, 9, 3, 4, 6, 2, +0, 1, 7, 8 ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Killed] EqualityOperator
src/QuickSortRecursive.js:31:25
 const partition = (partitionList, low, high) => {
   const pivot = partitionList[high];
   let pIndex = low;
-  for (let index = low; index <= high - 1; index++) {
+  for (let index = low; index > high - 1; index++) {
     if (partitionList[index] < pivot) {
       // swap variables using array destructuring
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ 8, 5, 9, 3, 4, 6, 2, +0, 1, 7 ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Killed] BlockStatement
src/QuickSortRecursive.js:31:53
 const partition = (partitionList, low, high) => {
   const pivot = partitionList[high];
   let pIndex = low;
-  for (let index = low; index <= high - 1; index++) {
-    if (partitionList[index] < pivot) {
-      // swap variables using array destructuring
-      [partitionList[index], partitionList[pIndex]] = [
-        partitionList[pIndex],
-        partitionList[index],
-      ];
-      pIndex += 1;
-    }
-  }
+  for (let index = low; index <= high - 1; index++) {}
   [partitionList[pIndex], partitionList[high]] = [
     partitionList[high],
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ 8, 5, 9, 3, 4, 6, 2, +0, 1, 7 ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Killed] EqualityOperator
src/QuickSortRecursive.js:32:9
   const pivot = partitionList[high];
   let pIndex = low;
   for (let index = low; index <= high - 1; index++) {
-    if (partitionList[index] < pivot) {
+    if (partitionList[index] >= pivot) {
       // swap variables using array destructuring
       [partitionList[index], partitionList[pIndex]] = [
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ 9, 8, 7, 6, 5, 4, 3, 2, 1, +0 ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Killed] ConditionalExpression
src/QuickSortRecursive.js:32:9
   const pivot = partitionList[high];
   let pIndex = low;
   for (let index = low; index <= high - 1; index++) {
-    if (partitionList[index] < pivot) {
+    if (false) {
       // swap variables using array destructuring
       [partitionList[index], partitionList[pIndex]] = [
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ 8, 5, 9, 3, 4, 6, 2, +0, 1, 7 ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Killed] AssignmentOperator
src/QuickSortRecursive.js:38:7
         partitionList[pIndex],
         partitionList[index],
       ];
-      pIndex += 1;
+      pIndex -= 1;
     }
   }
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ Array(10) ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]

[Killed] ArrayDeclaration
src/QuickSortRecursive.js:41:50
       pIndex += 1;
     }
   }
-  [partitionList[pIndex], partitionList[high]] = [
-    partitionList[high],
-    partitionList[pIndex],
-  ];
+  [partitionList[pIndex], partitionList[high]] = [];
   return pIndex;
 };
killedBy: QuickSortRecursive | Partition In Place Method Expectedly, the quickSort method will sort the unsorted list in ascending order
statusReason: expected [ +0, undefined, undefined, …(7) ] to deeply equal [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9 ]
