[Killed] ConditionalExpression
src/SelectionSort.js:2:7
 export const selectionSort = (list) => {
-  if (!Array.isArray(list)) {
+  if (true) {
     throw new TypeError("Given input is not an array");
   }
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: Given input is not an array

[Killed] BlockStatement
src/SelectionSort.js:2:29
 export const selectionSort = (list) => {
-  if (!Array.isArray(list)) {
-    throw new TypeError("Given input is not an array");
-  }
+  if (!Array.isArray(list)) {}
   const items = [...list]; // We don't want to modify the original array
   const length = items.length;
killedBy: selectionSort expects to throw if it is not a valid array
statusReason: expected [Function] to throw error including 'Given input is not an array' but got 'One of the items in your array is not…'

[Killed] ConditionalExpression
src/SelectionSort.js:7:19
   }
   const items = [...list]; // We don't want to modify the original array
   const length = items.length;
-  for (let i = 0; i < length - 1; i++) {
+  for (let i = 0; false; i++) {
     if (typeof items[i] !== "number") {
       throw new TypeError("One of the items in your array is not a number");
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: expected [ 5, 6, 7, 8, 1, 2, 12, 14 ] to deeply equal [ 1, 2, 5, 6, 7, 8, 12, 14 ]

[Killed] UpdateOperator
src/SelectionSort.js:7:35
   }
   const items = [...list]; // We don't want to modify the original array
   const length = items.length;
-  for (let i = 0; i < length - 1; i++) {
+  for (let i = 0; i < length - 1; i--) {
     if (typeof items[i] !== "number") {
       throw new TypeError("One of the items in your array is not a number");
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: One of the items in your array is not a number

[Killed] ConditionalExpression
src/SelectionSort.js:8:9
   const items = [...list]; // We don't want to modify the original array
   const length = items.length;
   for (let i = 0; i < length - 1; i++) {
-    if (typeof items[i] !== "number") {
+    if (false) {
       throw new TypeError("One of the items in your array is not a number");
     }
killedBy: selectionSort expects to throw if one of the elements in the array is not a number
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/SelectionSort.js:8:9
   const items = [...list]; // We don't want to modify the original array
   const length = items.length;
   for (let i = 0; i < length - 1; i++) {
-    if (typeof items[i] !== "number") {
+    if (typeof items[i] === "number") {
       throw new TypeError("One of the items in your array is not a number");
     }
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: One of the items in your array is not a number

[Killed] ConditionalExpression
src/SelectionSort.js:13:25
     }
     // Number of passes
     let min = i; // min holds the current minimum number position for each pass; i holds the Initial min number
-    for (let j = i + 1; j < length; j++) {
+    for (let j = i + 1; false; j++) {
       // Note that j = i + 1 as we only need to go through unsorted array
       if (items[j] < items[min]) {
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: expected [ 5, 6, 7, 8, 1, 2, 12, 14 ] to deeply equal [ 1, 2, 5, 6, 7, 8, 12, 14 ]

[Killed] BlockStatement
src/SelectionSort.js:13:42
     }
     // Number of passes
     let min = i; // min holds the current minimum number position for each pass; i holds the Initial min number
-    for (let j = i + 1; j < length; j++) {
-      // Note that j = i + 1 as we only need to go through unsorted array
-      if (items[j] < items[min]) {
-        // Compare the numbers
-        min = j; // Change the current min number position if a smaller num is found
-      }
-    }
+    for (let j = i + 1; j < length; j++) {}
     if (min !== i) {
       // After each pass, if the current min num != initial min num, exchange the position.
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: expected [ 5, 6, 7, 8, 1, 2, 12, 14 ] to deeply equal [ 1, 2, 5, 6, 7, 8, 12, 14 ]

[Killed] EqualityOperator
src/SelectionSort.js:15:11
     let min = i; // min holds the current minimum number position for each pass; i holds the Initial min number
     for (let j = i + 1; j < length; j++) {
       // Note that j = i + 1 as we only need to go through unsorted array
-      if (items[j] < items[min]) {
+      if (items[j] >= items[min]) {
         // Compare the numbers
         min = j; // Change the current min number position if a smaller num is found
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: expected [ 14, 12, 8, 7, 6, 5, 2, 1 ] to deeply equal [ 1, 2, 5, 6, 7, 8, 12, 14 ]

[Killed] ConditionalExpression
src/SelectionSort.js:15:11
     let min = i; // min holds the current minimum number position for each pass; i holds the Initial min number
     for (let j = i + 1; j < length; j++) {
       // Note that j = i + 1 as we only need to go through unsorted array
-      if (items[j] < items[min]) {
+      if (true) {
         // Compare the numbers
         min = j; // Change the current min number position if a smaller num is found
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: expected [ 14, 5, 6, 7, 8, 1, 2, 12 ] to deeply equal [ 1, 2, 5, 6, 7, 8, 12, 14 ]

[Killed] BlockStatement
src/SelectionSort.js:20:20
         min = j; // Change the current min number position if a smaller num is found
       }
     }
-    if (min !== i) {
-      // After each pass, if the current min num != initial min num, exchange the position.
-      // Swap the numbers
-      [items[i], items[min]] = [items[min], items[i]];
-    }
+    if (min !== i) {}
   }
   return items;
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: expected [ 5, 6, 7, 8, 1, 2, 12, 14 ] to deeply equal [ 1, 2, 5, 6, 7, 8, 12, 14 ]

[Killed] ConditionalExpression
src/SelectionSort.js:20:9
         min = j; // Change the current min number position if a smaller num is found
       }
     }
-    if (min !== i) {
+    if (false) {
       // After each pass, if the current min num != initial min num, exchange the position.
       // Swap the numbers
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: expected [ 5, 6, 7, 8, 1, 2, 12, 14 ] to deeply equal [ 1, 2, 5, 6, 7, 8, 12, 14 ]

[Killed] ArrayDeclaration
src/SelectionSort.js:23:32
     if (min !== i) {
       // After each pass, if the current min num != initial min num, exchange the position.
       // Swap the numbers
-      [items[i], items[min]] = [items[min], items[i]];
+      [items[i], items[min]] = [];
     }
   }
killedBy: selectionSort expects to return the array sorted in ascending order
statusReason: One of the items in your array is not a number
