[Killed] ArithmeticOperator
src/SimplifiedWiggleSort.js:5:50
 
 export const simplifiedWiggleSort = function (arr) {
   // find Median using QuickSelect
-  let median = quickSelectSearch(arr, Math.floor(arr.length / 2.0));
+  let median = quickSelectSearch(arr, Math.floor(arr.length * 2.0));
   median = median[Math.floor(arr.length / 2.0)];
 
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: Invalid arguments

[Survived] ArithmeticOperator
src/SimplifiedWiggleSort.js:6:30
 export const simplifiedWiggleSort = function (arr) {
   // find Median using QuickSelect
   let median = quickSelectSearch(arr, Math.floor(arr.length / 2.0));
-  median = median[Math.floor(arr.length / 2.0)];
+  median = median[Math.floor(arr.length * 2.0)];
 
   const sorted = new Array(arr.length);

[Survived] ArrayDeclaration
src/SimplifiedWiggleSort.js:8:18
   let median = quickSelectSearch(arr, Math.floor(arr.length / 2.0));
   median = median[Math.floor(arr.length / 2.0)];
 
-  const sorted = new Array(arr.length);
+  const sorted = new Array();
 
   let smallerThanMedianIndx = 0;

[Killed] ArithmeticOperator
src/SimplifiedWiggleSort.js:11:49
   const sorted = new Array(arr.length);
 
   let smallerThanMedianIndx = 0;
-  let greaterThanMedianIndx = arr.length - 1 - (arr.length % 2);
+  let greaterThanMedianIndx = arr.length - 1 - (arr.length * 2);
 
   for (let i = 0; i < arr.length; i++) {
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'a', undefined, 'b' ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] ArithmeticOperator
src/SimplifiedWiggleSort.js:11:31
   const sorted = new Array(arr.length);
 
   let smallerThanMedianIndx = 0;
-  let greaterThanMedianIndx = arr.length - 1 - (arr.length % 2);
+  let greaterThanMedianIndx = arr.length - 1 + arr.length % 2;
 
   for (let i = 0; i < arr.length; i++) {
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'a', undefined, 'b', 'c' ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] EqualityOperator
src/SimplifiedWiggleSort.js:14:9
   let greaterThanMedianIndx = arr.length - 1 - (arr.length % 2);
 
   for (let i = 0; i < arr.length; i++) {
-    if (arr[i] > median) {
+    if (arr[i] <= median) {
       sorted[greaterThanMedianIndx] = arr[i];
       greaterThanMedianIndx -= 2;
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'c', 'a', undefined ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] BlockStatement
src/SimplifiedWiggleSort.js:14:26
   let greaterThanMedianIndx = arr.length - 1 - (arr.length % 2);
 
   for (let i = 0; i < arr.length; i++) {
-    if (arr[i] > median) {
-      sorted[greaterThanMedianIndx] = arr[i];
-      greaterThanMedianIndx -= 2;
-    } else {
+    if (arr[i] > median) {} else {
       if (smallerThanMedianIndx < arr.length) {
         sorted[smallerThanMedianIndx] = arr[i];
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'a', undefined, 'b' ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] AssignmentOperator
src/SimplifiedWiggleSort.js:16:7
   for (let i = 0; i < arr.length; i++) {
     if (arr[i] > median) {
       sorted[greaterThanMedianIndx] = arr[i];
-      greaterThanMedianIndx -= 2;
+      greaterThanMedianIndx += 2;
     } else {
       if (smallerThanMedianIndx < arr.length) {
killedBy: simplified wiggle sort wiggle sort with duplicates, odd array
statusReason: expected [ 1, undefined, 1, 2, 1, 4 ] to deeply equal [ 1, 4, 1, 2, 1 ]

[Killed] BlockStatement
src/SimplifiedWiggleSort.js:17:12
     if (arr[i] > median) {
       sorted[greaterThanMedianIndx] = arr[i];
       greaterThanMedianIndx -= 2;
-    } else {
-      if (smallerThanMedianIndx < arr.length) {
-        sorted[smallerThanMedianIndx] = arr[i];
-        smallerThanMedianIndx += 2;
-      } else {
-        sorted[greaterThanMedianIndx] = arr[i];
-        greaterThanMedianIndx -= 2;
-      }
-    }
+    } else {}
   }
 
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ undefined, 'c', undefined ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] EqualityOperator
src/SimplifiedWiggleSort.js:18:11
       sorted[greaterThanMedianIndx] = arr[i];
       greaterThanMedianIndx -= 2;
     } else {
-      if (smallerThanMedianIndx < arr.length) {
+      if (smallerThanMedianIndx >= arr.length) {
         sorted[smallerThanMedianIndx] = arr[i];
         smallerThanMedianIndx += 2;
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ undefined, 'a', undefined ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] BlockStatement
src/SimplifiedWiggleSort.js:18:47
       sorted[greaterThanMedianIndx] = arr[i];
       greaterThanMedianIndx -= 2;
     } else {
-      if (smallerThanMedianIndx < arr.length) {
-        sorted[smallerThanMedianIndx] = arr[i];
-        smallerThanMedianIndx += 2;
-      } else {
+      if (smallerThanMedianIndx < arr.length) {} else {
         sorted[greaterThanMedianIndx] = arr[i];
         greaterThanMedianIndx -= 2;
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ undefined, 'c', undefined ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] AssignmentOperator
src/SimplifiedWiggleSort.js:20:9
     } else {
       if (smallerThanMedianIndx < arr.length) {
         sorted[smallerThanMedianIndx] = arr[i];
-        smallerThanMedianIndx += 2;
+        smallerThanMedianIndx -= 2;
       } else {
         sorted[greaterThanMedianIndx] = arr[i];
killedBy: simplified wiggle sort simplified wiggle sort for chars
statusReason: expected [ 'a', 'c', undefined ] to deeply equal [ 'a', 'c', 'b' ]

[Killed] BlockStatement
src/SimplifiedWiggleSort.js:21:14
       if (smallerThanMedianIndx < arr.length) {
         sorted[smallerThanMedianIndx] = arr[i];
         smallerThanMedianIndx += 2;
-      } else {
-        sorted[greaterThanMedianIndx] = arr[i];
-        greaterThanMedianIndx -= 2;
-      }
+      } else {}
     }
   }
killedBy: simplified wiggle sort wiggle sort with duplicates, even array
statusReason: expected [ 1, undefined, 2, 3 ] to deeply equal [ 1, 3, 2, 2 ]
