[NoCoverage] BlockStatement
src/DijkstraSmallestPath.js:12:32
     let neighbor = null
     let dist = Infinity
 
-    for (const n in solutions) {
-      if (!solutions[n]) {
-        continue
-      }
-      const ndist = solutions[n].dist
-      const adj = graph[n]
-
-      for (const a in adj) {
-        if (solutions[a]) {
-          continue
-        }
-
-        const d = adj[a] + ndist
-        if (d < dist) {
-          p = solutions[n]
-          neighbor = a
-          dist = d
-        }
-      }
-    }
+    for (const n in solutions) {}
 
     // no more solutions

[NoCoverage] ConditionalExpression
src/DijkstraSmallestPath.js:13:11
     let dist = Infinity
 
     for (const n in solutions) {
-      if (!solutions[n]) {
+      if (true) {
         continue
       }

[NoCoverage] BooleanLiteral
src/DijkstraSmallestPath.js:13:11
     let dist = Infinity
 
     for (const n in solutions) {
-      if (!solutions[n]) {
+      if (solutions[n]) {
         continue
       }

[NoCoverage] BlockStatement
src/DijkstraSmallestPath.js:19:28
       const ndist = solutions[n].dist
       const adj = graph[n]
 
-      for (const a in adj) {
-        if (solutions[a]) {
-          continue
-        }
-
-        const d = adj[a] + ndist
-        if (d < dist) {
-          p = solutions[n]
-          neighbor = a
-          dist = d
-        }
-      }
+      for (const a in adj) {}
     }
 

[NoCoverage] ArithmeticOperator
src/DijkstraSmallestPath.js:24:19
           continue
         }
 
-        const d = adj[a] + ndist
+        const d = adj[a] - ndist
         if (d < dist) {
           p = solutions[n]

[NoCoverage] ConditionalExpression
src/DijkstraSmallestPath.js:25:13
         }
 
         const d = adj[a] + ndist
-        if (d < dist) {
+        if (true) {
           p = solutions[n]
           neighbor = a

[NoCoverage] ConditionalExpression
src/DijkstraSmallestPath.js:25:13
         }
 
         const d = adj[a] + ndist
-        if (d < dist) {
+        if (false) {
           p = solutions[n]
           neighbor = a

[NoCoverage] BlockStatement
src/DijkstraSmallestPath.js:34:28
     }
 
     // no more solutions
-    if (dist === Infinity) {
-      break
-    }
+    if (dist === Infinity) {}
 
     // extend parent's solution path
