[Killed] BlockStatement
src/KruskalMST.js:3:20
 class DisjointSetTreeNode {
   // Disjoint Set Node to store the parent and rank
-  constructor(key) {
-    this.key = key
-    this.parent = this
-    this.rank = 0
-  }
+  constructor(key) {}
 }
 
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] BlockStatement
src/KruskalMST.js:12:17
 
 class DisjointSetTree {
   // Disjoint Set DataStructure
-  constructor() {
-    // map to from node name to the node object
-    this.map = {}
-  }
+  constructor() {}
 
   makeSet(x) {
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot set properties of undefined (setting '1')

[Killed] BlockStatement
src/KruskalMST.js:17:14
     this.map = {}
   }
 
-  makeSet(x) {
-    // Function to create a new set with x as its member
-    this.map[x] = new DisjointSetTreeNode(x)
-  }
+  makeSet(x) {}
 
   findSet(x) {
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot read properties of undefined (reading 'parent')

[Killed] BlockStatement
src/KruskalMST.js:22:14
     this.map[x] = new DisjointSetTreeNode(x)
   }
 
-  findSet(x) {
-    // Function to find the set x belongs to (with path-compression)
-    if (this.map[x] !== this.map[x].parent) {
-      this.map[x].parent = this.findSet(this.map[x].parent.key)
-    }
-    return this.map[x].parent
-  }
+  findSet(x) {}
 
   union(x, y) {
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] BlockStatement
src/KruskalMST.js:24:45
 
   findSet(x) {
     // Function to find the set x belongs to (with path-compression)
-    if (this.map[x] !== this.map[x].parent) {
-      this.map[x].parent = this.findSet(this.map[x].parent.key)
-    }
+    if (this.map[x] !== this.map[x].parent) {}
     return this.map[x].parent
   }

[Survived] BlockStatement
src/KruskalMST.js:30:15
     return this.map[x].parent
   }
 
-  union(x, y) {
-    // Function to merge 2 disjoint sets
-    this.link(this.findSet(x), this.findSet(y))
-  }
+  union(x, y) {}
 
   link(x, y) {

[Survived] BlockStatement
src/KruskalMST.js:35:14
     this.link(this.findSet(x), this.findSet(y))
   }
 
-  link(x, y) {
-    // Helper function for union operation
-    if (x.rank > y.rank) {
-      y.parent = x
-    } else {
-      x.parent = y
-      if (x.rank === y.rank) {
-        y.rank += 1
-      }
-    }
-  }
+  link(x, y) {}
 }
 

[Survived] BlockStatement
src/KruskalMST.js:39:12
     // Helper function for union operation
     if (x.rank > y.rank) {
       y.parent = x
-    } else {
-      x.parent = y
-      if (x.rank === y.rank) {
-        y.rank += 1
-      }
-    }
+    } else {}
   }
 }

[Survived] ConditionalExpression
src/KruskalMST.js:41:11
       y.parent = x
     } else {
       x.parent = y
-      if (x.rank === y.rank) {
+      if (false) {
         y.rank += 1
       }

[Survived] EqualityOperator
src/KruskalMST.js:41:11
       y.parent = x
     } else {
       x.parent = y
-      if (x.rank === y.rank) {
+      if (x.rank !== y.rank) {
         y.rank += 1
       }

[Survived] AssignmentOperator
src/KruskalMST.js:42:9
     } else {
       x.parent = y
       if (x.rank === y.rank) {
-        y.rank += 1
+        y.rank -= 1
       }
     }

[Killed] BlockStatement
src/KruskalMST.js:50:17
 
 class GraphWeightedUndirectedAdjacencyList {
   // Weighted Undirected Graph class
-  constructor() {
-    this.connections = {}
-    this.nodes = 0
-  }
+  constructor() {}
 
   addNode(node) {
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot use 'in' operator to search for '1' in undefined

[Killed] BlockStatement
src/KruskalMST.js:55:17
     this.nodes = 0
   }
 
-  addNode(node) {
-    // Function to add a node to the graph (connection represented by set)
-    this.connections[node] = {}
-    this.nodes += 1
-  }
+  addNode(node) {}
 
   addEdge(node1, node2, weight) {
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot set properties of undefined (setting '2')

[Killed] AssignmentOperator
src/KruskalMST.js:58:5
   addNode(node) {
     // Function to add a node to the graph (connection represented by set)
     this.connections[node] = {}
-    this.nodes += 1
+    this.nodes -= 1
   }
 
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: expected {} to deeply equal { '1': { '2': 1 }, …(4) }

[Killed] BlockStatement
src/KruskalMST.js:61:33
     this.nodes += 1
   }
 
-  addEdge(node1, node2, weight) {
-    // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections)) {
-      this.addNode(node1)
-    }
-    if (!(node2 in this.connections)) {
-      this.addNode(node2)
-    }
-    this.connections[node1][node2] = weight
-    this.connections[node2][node1] = weight
-  }
+  addEdge(node1, node2, weight) {}
 
   KruskalMST() {
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: expected {} to deeply equal { '1': { '2': 1 }, …(4) }

[Killed] BlockStatement
src/KruskalMST.js:63:39
 
   addEdge(node1, node2, weight) {
     // Function to add an edge (adds the node too if they are not present in the graph)
-    if (!(node1 in this.connections)) {
-      this.addNode(node1)
-    }
+    if (!(node1 in this.connections)) {}
     if (!(node2 in this.connections)) {
       this.addNode(node2)
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot set properties of undefined (setting '2')

[Killed] ArrayDeclaration
src/KruskalMST.js:77:19
     // Kruskal's Algorithm to generate a Minimum Spanning Tree (MST) of a graph
     // Details: https://en.wikipedia.org/wiki/Kruskal%27s_algorithm
     // getting the edges in ascending order of weights
-    const edges = []
+    const edges = ["Stryker was here"]
     const seen = new Set()
     for (const start of Object.keys(this.connections)) {
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot read properties of undefined (reading 'parent')

[Killed] BlockStatement
src/KruskalMST.js:79:56
     // getting the edges in ascending order of weights
     const edges = []
     const seen = new Set()
-    for (const start of Object.keys(this.connections)) {
-      for (const end of Object.keys(this.connections[start])) {
-        if (!seen.has(`${start} ${end}`)) {
-          seen.add(`${end} ${start}`)
-          edges.push([start, end, this.connections[start][end]])
-        }
-      }
-    }
+    for (const start of Object.keys(this.connections)) {}
     edges.sort((a, b) => a[2] - b[2])
     // creating the disjoint set
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/KruskalMST.js:80:63
     const edges = []
     const seen = new Set()
     for (const start of Object.keys(this.connections)) {
-      for (const end of Object.keys(this.connections[start])) {
-        if (!seen.has(`${start} ${end}`)) {
-          seen.add(`${end} ${start}`)
-          edges.push([start, end, this.connections[start][end]])
-        }
-      }
+      for (const end of Object.keys(this.connections[start])) {}
     }
     edges.sort((a, b) => a[2] - b[2])
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrayDeclaration
src/KruskalMST.js:83:22
       for (const end of Object.keys(this.connections[start])) {
         if (!seen.has(`${start} ${end}`)) {
           seen.add(`${end} ${start}`)
-          edges.push([start, end, this.connections[start][end]])
+          edges.push([])
         }
       }
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot read properties of undefined (reading 'parent')

[Killed] ArrowFunction
src/KruskalMST.js:87:16
         }
       }
     }
-    edges.sort((a, b) => a[2] - b[2])
+    edges.sort(() => undefined)
     // creating the disjoint set
     const disjointSet = new DisjointSetTree()
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: expected { '1': { '2': 1 }, …(4) } to deeply equal { '1': { '2': 1 }, …(4) }

[Killed] MethodExpression
src/KruskalMST.js:87:5
         }
       }
     }
-    edges.sort((a, b) => a[2] - b[2])
+    edges
     // creating the disjoint set
     const disjointSet = new DisjointSetTree()
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: expected { '1': { '2': 1 }, …(4) } to deeply equal { '1': { '2': 1 }, …(4) }

[Killed] ArrowFunction
src/KruskalMST.js:90:43
     edges.sort((a, b) => a[2] - b[2])
     // creating the disjoint set
     const disjointSet = new DisjointSetTree()
-    Object.keys(this.connections).forEach((node) => disjointSet.makeSet(node))
+    Object.keys(this.connections).forEach(() => undefined)
     // MST generation
     const graph = new GraphWeightedUndirectedAdjacencyList()
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: Cannot read properties of undefined (reading 'parent')

[Killed] ConditionalExpression
src/KruskalMST.js:95:12
     const graph = new GraphWeightedUndirectedAdjacencyList()
     let numEdges = 0
     let index = 0
-    while (numEdges < this.nodes - 1) {
+    while (false) {
       const [u, v, w] = edges[index]
       index += 1
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: expected {} to deeply equal { '1': { '2': 1 }, …(4) }

[Killed] ArithmeticOperator
src/KruskalMST.js:95:23
     const graph = new GraphWeightedUndirectedAdjacencyList()
     let numEdges = 0
     let index = 0
-    while (numEdges < this.nodes - 1) {
+    while (numEdges < this.nodes + 1) {
       const [u, v, w] = edges[index]
       index += 1
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] AssignmentOperator
src/KruskalMST.js:97:7
     let index = 0
     while (numEdges < this.nodes - 1) {
       const [u, v, w] = edges[index]
-      index += 1
+      index -= 1
       if (disjointSet.findSet(u) !== disjointSet.findSet(v)) {
         numEdges += 1
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/KruskalMST.js:98:62
     while (numEdges < this.nodes - 1) {
       const [u, v, w] = edges[index]
       index += 1
-      if (disjointSet.findSet(u) !== disjointSet.findSet(v)) {
-        numEdges += 1
-        graph.addEdge(u, v, w)
-        disjointSet.union(u, v)
-      }
+      if (disjointSet.findSet(u) !== disjointSet.findSet(v)) {}
     }
     return graph
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] EqualityOperator
src/KruskalMST.js:98:11
     while (numEdges < this.nodes - 1) {
       const [u, v, w] = edges[index]
       index += 1
-      if (disjointSet.findSet(u) !== disjointSet.findSet(v)) {
+      if (disjointSet.findSet(u) === disjointSet.findSet(v)) {
         numEdges += 1
         graph.addEdge(u, v, w)
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] AssignmentOperator
src/KruskalMST.js:99:9
       const [u, v, w] = edges[index]
       index += 1
       if (disjointSet.findSet(u) !== disjointSet.findSet(v)) {
-        numEdges += 1
+        numEdges -= 1
         graph.addEdge(u, v, w)
         disjointSet.union(u, v)
killedBy: Kruskal's Algorithm should generate a Minimum Spanning Tree (MST) for a graph
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
